[
    {
        "hadis": "Ebu-Hurejre, r.a., prenosi da je Allahov Poslanik, sallallahu ‘alejhi ve selleme, rekao: \"Svi moji sljedbenici će ući u Džennet, osim onih koji ne htjednu.\" Neko reče: \"A ko će odbiti da uđe u Džennet, Allahov Poslaniče?\" \"Ko mi se bude pokoravao, taj će ući u Džennet, a ko mi se suprotstavi, odbit će!\", odgovori on. (Buhari)"
    },
    {
        "hadis": "Ebu-Musa, r.a., prenosi da je Allahov Poslanik, sallallahu 'alejhi ve selleme, rekao: \"Mu'min prema mu'minu je kao dijelovi jedne zgrade, jedan drugog učvršćuje.\" I tada, on svoje prste ispreplete. - (Muttefekun alejhi)"
    },
    {
        "hadis": "Ebu Hurejre r.a. prenosi da je Allahov Poslanik, sallallahu `alejhi ve selleme,  rekao: \"Nije junaštvo u hrvanju (dvobojima), nego je junak onaj koji se strpi pri svojoj srdžbi\" - (Muttefekun alejhi)"
    },
    {
        "hadis": "Tarik b. Ešjeme, r.a., kazuje: \"Kada bi neko primio islam, Allahov Poslanik, a.s., bi ga podučio namazu, a zatim bi mu naredio da prouči ovu dovu: 'Gospodaru moj, oprosti mi, smiluj mi se, uputi me, zaštiti me i opskrbi me!'\" Prema drugom hadisu, Tarik kazuje da je čuo, kada je neko rekao: \"Allahov Poslaniče,šta da učim kada molim Allaha?\" \"Prouči\", odgovori mu: 'Gospodaru, oprosti mi, smiluj mi se, zaštiti me i opskrbi me!' Ova dova sadrži dobro ovoga i budućeg svijeta.'\" (Muslim)"
    },
    {
        "hadis": "Ukbe b. 'Amir, r.a., prenosi da je Allahov Poslanik, a.s., rekao: \"Čuvajte se osamljivanja sa ženama koje vam nisu bliža rodbina!\" Jedan ensarija zapita: \"A mužev brat?\" \"Mužev brat je kao smrt.\" (Muttefekun alejhi)"
    },
    {
        "hadis": "Od Ebu-Hurejrea, r.a., prenosi se da je Allahov Poslanik, s.a.v.s., rekao: \"Kada čovjek umre, njegova djelatnost se prekida, osim u tri slučaja: (ako je ostavio) trajnu sadaku, ili nauku (znanje ili izum) koja je od koristi, ili dobro dijete, koje za njega dovu čini.\" (Muslim)"
    },
    {
        "hadis": "Usame b. Zejd, r.a., prenosi da je Allahov Poslanik, a.s., rekao: \"Ne putujte u mjesto u kojem se pojavi zarazna bolest, a ako se već tamo zadesite, ne napuštajte ga.\" (Muttefekun alejhi)"
    },
    {
        "hadis": "Enes ibn Malik el-Ensari, omiljeni sluga Poslanikov, pripovjeda da je Allahov Poslanik, sallallahu 'alejhi ve selleme, rekao: \"Allah se više obraduje pokajanju Njegova roba, nego što bi se neko od vas obradovao pronalasku svoje izgubljene deve u pustinji bez vode i plodova.\" (Muttefekun alejhi) U drugom Muslimovom rivajetu, stoji: \"Allah se više obraduje tevbi Svoga roba, koji se pokaje, nego što bi to učinio neko od vas kada bi putovao na devi kroz pustinju i ona mu pobjegne, a na njoj mu sva hrana i voda, pa je dugo tražio i, izgubivši svaku nadu da će je pronaći, legao u hlad jednog drveta da se odmori, i u takvom stanju očaja, odjedanput,ugledao svoju devu u neposrednoj blizini njegovoj kako mirno stoji, te odmah skočio i uhvatio je za povodac i, od silne radosti, uzviknuo: 'Bože moj, Ti si moj rob, a ja sam tvoj gospodar!', pogrešno se izrazivši od silne radosti.\""
    },
    {
        "hadis": "Ebu-Hurejre, r.a., prenosi da je Allahov Poslanik, sallallahu ‘alejhi ve selleme, rekao: \"Daleko bio (od Allahove milosti), daleko bio, daleko bio svako onaj ko dočeka starost svojih roditelja, ili jednog od njih, a (zbog njih) ne uđe u Džennet!\" – (Muslim)"
    },
    {
        "hadis": "Od Aiše, r.a., prenosi se da je Vjerovjesnik, s.a.v.s., boravio u i'tikafu zadnjih deset dana ramazana, sve dok mu Uzvišeni Allah nije uzeo život, a poslije njega su u i'tikafu boravile njegove žene. (Muttefekun alejhi)"
    },
    {
        "hadis": "Ebu-Zerr, r.a., pripovijeda da mu je Allahov Poslanik, sallallahu ‘alejhi ve selleme, rekao: \"Nipošto ne potcjenjuj (ne omalovažavaj) ništa od dobrih djela, pa i da se sretneš radosna lica sa svojim bratom (prijateljem).\" - (Muslim)"
    },
    {
        "hadis": "Ebu-Hurejre, r.a., prenosi da je Allahov Poslanik, sallallahu 'alejhi ve selleme, rekao: \"Novac koji potrošiš na Allahovom putu, novac koji potrošiš za oslobadanje robova, novac koji podijeliš siromasima i novac koji potrošiš na svoju obitelj; najveća je nagrada za onaj novac koji si potrošio za svoju obitelj.\" - (Muslim)"
    },
    {
        "hadis": "Od ashaba Sulejmana bin 'Amira ed-Dabbija, r.a., prenosi se da je Vjerovjesnik,s.a.v.s., rekao: \"Kada neko od vas iftari, neka se iftari temrama (datulama), a ako nema, neka se iftari vodom, jer je ona čista.\" (Ebu-Davud, Tirmizi, hasen, sahih)"
    },
    {
        "hadis": "Enes, r.a., prenosi da je Allahov Poslanik, sallallahu 'alejhi ve selleme, rekao: \"Ako Allah, dž.š., želi Svome robu hajr, onda mu požuri sa njegovim kaznama na ovome svijetu. A ako Allah, dž.š., želi Svome robu zlo, onda mu odgodi kaznu za njegove grijehe, kako bi je u potpunosti iskusio na ahiretu.\" Zatim je rekao: \"Zaista je veličina nagrade prema veličini iskušenja, zato Allah, dž.š.,, kada zavoli jedan narod, postavi ga na razne kušnje, pa ko bude zadovoljan time, Allah bit će zadovoljan njime, a ko se srdi zbog toga, njemu pripada Allahova srdžba.\" (Tirmizi, hasen, Buhari)"
    },
    {
        "hadis": "Prenosi se od Ebu-Hurejrea, r.a., da je Allahov Poslanik, s.a.v.s., rekao: \"Kada neko od vas sretne svoga brata (muslimana) neka mu nazove selam, pa ako ih razdvoji drvo, zid ili kamen pa se sretnu, neka ga poselami opet.\" (Ebu-Davud, sahih)"
    },
    {
        "hadis": "Abdulah b. 'Amr b. 'As, r.a., prenosi da je Allahov Poslanik, a.s., rekao: \"Ne čupajte sijede vlasi jer su one svjetlo muslimana na Sudnjem danu.\" (Ebu-Davud, Tirmizi, hasen)"
    },
    {
        "hadis": "Ibn-'Abbas, r.a., prenosi od Vjerovjesnika, s.a.v.s., da je rekao: \"Da neko od vas, kada hoće imati odnos sa ženom, kaže: 'Bismillahi, allahumme džennibna eššejtane ve džennibiššejtane ma rezektena' (U ime Allaha, Allahu moj, sačuvaj nas od šejtana, i sačuvaj od šejtana ono što nam daš), i ukoliko bi im se našlo dijete, ne bi mu (šejtan) mogao nauditi.\" (Muttefekun alejhi)"
    },
    {
        "hadis": "Sevban, r.a., pripovijeda da je čuo Allahovog Poslanika, sallallahu 'alejhi ve selleme, kada je rekao: \"Preporučujem ti da često sedždu činiš, jer ti Allah za svaku sedždu poveća jednu deredžu i izbriše jedan od tvojih grijeha.\" - (Muslim)"
    },
    {
        "hadis": "Ebu-Musa el-Eš'ari, r.a., kazuje: \"Allahov Poslanik, a.s., čuo je kako jednog čovjeka veličaju i prekomjerno hvale, na što je rekao: 'Upropastili ste ga i uništili!'\" (Muttefekun alejhi)"
    },
    {
        "hadis": "Od Ebu-Hurejrea, r.a., prenosi se da je neki beduin došao Vjerovjesniku, s.a.v.s.,i rekao: \"O Allahov Poslaniče, uputi me na posao kojim ću, ako ga uradim ući u Džennet!\" On mu reče: \"Da obožavaš Allaha, ne čineći mu širk, obavljaš namaz, daješ obavezni zekat i postiš ramazan!\" On tada reče: \"Tako mi Onoga, u čijim je rukama moj život, na ovo ništa neću dodati!\" I kada se on okrenuo, Vjerovjesnik, s.a.v.s., rekao je: \"Ko želi da gleda dženetliju, neka gleda u ovog čovjeka!\" (Muttefekun alejhi)"
    },
    {
        "hadis": "Od Ebu-Hurejrea, r.a., prenosi da je Allahov Poslanik, s.a.v.s., rekao: \"Kada bi vjernik znao koje kazne kod Allaha postoje, ne bi niko očekivao Njegov Džennet, a kada bi nevjernik znao koliko kod Allaha ima rahmeta (milosti), ne bi nikad izgubio nadu u Njegov Džennet.\" - (Muslim)"
    },
    {
        "hadis": "Ebu-Hurejre, r.a., prenosi da je Allahov Poslanik, a.s., rekao: \"Ko ujutro i navečer prouči stotinu puta: 'Subhanallahi ve bi hamdihi.' (Neka je slavljen i uzvišen Allah), niko na Sudnjem danu neće imati bolje djelo od njega, osim onoga ko isto prouči, ili još više puta.\" (Muslim)"
    },
    {
        "hadis": "Ebu-Seid, r.a., prenosi: \"Allahov Poslanik, s.a.v.s., rekao je: 'Zaista će kod Allaha,dž.š., na Sudnjem danu imati najgori položaj čovjek koji ima odnos sa ženom, i ona imade odnos s njim, pa on onda otkrije njene tajne (otkrije i opiše u detalje što se između njih desilo).'\" (Muslim)"
    },
    {
        "hadis": "Od Huzejfe, r.a., prenosi se da je rekao: \"Jedne noći sam klanjao sa Vjerovjesnikom, s.a.v.s., i on je otpočeo učiti suru 'El-Bekara', pa rekoh (u sebi): 'Učinit će ruku' nakon sto ajeta!\", pa kad ih je proučio rekoh: 'Klanjat će sa njom jedan rekat!', pa kad ju je proučio rekoh: 'Nakon nje će na ruku'!'; zatim je otpočeo suru 'En-Nisa' i proučio je, pa suru 'Ali'Imran\", i proučio je, učeći tako da je svaki harf pravilno i tečno izgovarao. Kada bi proučio ajet u kom je tesbih izgovorio bi ga, kada bi naišao na dovu učinio bi dovu; kada bi proučio ajet u kom se utječe od šejtana; utjecao bi se od njega. Zatim je učinio ruku', izgovarajući 'subhane rabbijelazim', pa je ostao na ruku'u koliko i na kijamu, zatim rekao je 'semi'a Allahulimen hamideh rabbena lekel-hamd'; zatim je dugo stajao, blizu onoliko koliko je bio na ruku'u, zatim je sedždu učinio govoreći 'subhane rabbijel a'la\"', a sedžda je bila duga skoro koliko i kijam (stajanje).\" (Muslim)"
    },
    {
        "hadis": "Abdullah ibn 'Amr ibn 'As, r.a., prenosi da je Allahov Poslanik, sallallahu ‘alejhi ve selleme, rekao: \"Pravi musliman jeste onaj od čijih ruku i jezika su mirni drugi muslimani, a (pravi) je muhadžir onaj koji napusti sve ono što je Allah zabranio.\" - (Muttefekun alejhi)"
    },
    {
        "hadis": "Džabir, r.a., prenosi da je čuo Allahova Poslanika, sallallahu 'alejhi ve selleme, kad kaže: \"Između čovjeka i širka i nevjerovanja je napuštanje namaza.\" (Muslim)"
    },
    {
        "hadis": "Od Ebu-Mesuda Ensarija, r.a., prenosi se da je rekao: \"Allahov Poslanik doticao nas je svojim rukama po ramenima pred namaz i govorio: 'Ujednačite se, uravnajte se. Nemoj da budete jedan mimo drugog, pa da vaša srca Allah rastavi i razjedini, nek mi je bliži onaj ko je dostojan i razuman, pa oni koji su iza njih.\"' (Muslim)"
    },
    {
        "hadis": "Ebu-Džuhajfe Vehb ibn Abdullah, r.a., pripovijeda da je Allahov Poslanik, sallallahu 'alejhi ve selleme, pobratio Selmana i Ebu-Derdaa, r.a., pa je Selman posjetio Ebu-Derdaa i vidio njegovu ženu neurednu (slabo odjevenu i nesređenu), te joj rekao: 'Što si takva?' Ona mu odgovori: 'Tvoj brat Ebu- Derda nema nikakve želje za dunjalukom!' Zatim dođe Ebu-Derda, noseći mu hranu i reče: 'Ti jedi, a ja postim.' On mu na to odgovori: 'Ja neću jesti sve dok i ti ne budeš jeo sa mnom', pa su obojica jeli. Kada je došla noć, Ebu-Derda je htio klanjati (nafilu), pa mu je Selman rekao: 'Spavaj', te je on legao spavati, zatim nakon kraćeg vremena je ustao , a Selman mu ponovo reče: 'Spavaj.' Kada je došla zadnja trećina noći, Selman mu reče: 'Sada ustani na namaz', pa su zajedno klanjali, a nakon toga mu Selman reče: 'Ti, uistinu, imaš obaveze prema svome Gospodaru, prema samome sebi i prema svojoj ženi i djeci. Zato prema svakome od njih izvršavaj svoje obaveze, nikoga ne zapostavljajući.' Ebu-Derda sutradan je otišao Allahovom Poslaniku, sallallahu ‘alejhi ve selleme, i to mu ispricao, a Alajhisselam mu kaza: 'Selman je istinu rekao.'\" (On je u pravu.) - (Buhari)"
    },
    {
        "hadis": "Kabis b. Muharik, r.a., kazuje da je čuo Allahovog Poslanika, a.s., kada je rekao:\"U idolatriju spada proricanje sudbine, gatanje iz leta ptice i bacanje piljaka.\" (Ebu-Davud sa hasen senedom)"
    },
    {
        "hadis": "Enes, r.a., prenosi da je Allahov Poslanik, sallallahu 'alejhi ve selleme, rekao: \"Ko odgoji dvije kćeri, i o njima se brine dok ne odrastu i udaju se, doći će na Sudnjem danu, pa ćemo ja i on biti kao ova dva prsta.\" I sastavio je prste. - (Muslim)"
    },
    {
        "hadis": "Džabir, r.a., prenosi daje Allahov Poslanik, sallallahu ‘alejhi ve selleme, rekao: “Bojte se nasilja (nepravde), jer je nasilje tama i muka Sudnjega dana. Čuvajte se škrtosti i pohlepe, jer su škrtost i pohlepa upropastili narode prije vas, to ih je natjeralo na međusobno krvoproliće, da halalom učine i rade ono što im je bilo haram.\" -   (Muslim)"
    },
    {
        "hadis": "Ebu-Hurejre, r.a., pripovijeda: \"Allahov Poslanik, sallallahu 'alejhi ve selleme, zabranio je da se pije direktno iz usta (grlića) posude ili mješine.\" (za vodu i sl, jer se piće ne vidi, a u njemu se može naći nešto što treba odstraniti - Pr. prev.). (Muttefekun alejhi)"
    },
    {
        "hadis": "Ebu-Hurejre, r.a., prenosi da je Allahov Poslanik, a.s., rekao: \"Uzvišeni Allah kaže: 'Objavio sam rat onome ko bude neprijatelj mome prijatelju. Najdraže Meni čime Mi se Moj rob može približiti jesu farzovi. Moj rob Mi se približuje nafilama sve dok ga ne zavolim, a kada ga zavolim, postanem njegov sluh kojim čuje, njegov vid kojim vidi, njegova ruka kojom prihvaća i njegova noga kojom hodi. Ako Me zamoli, udovoljit ću mu, a ako zatraži Moju zaštitu, zaštitit ću ga.\"' - (Buhari)"
    },
    {
        "hadis": "Džabir, r.a., prenosi: \"Čuo sam Allahova Poslanika, s.a.v.s., kako kaže: 'Kada neko od vas uđe u svoju kuću, pa spomene Uzvišenog Allaha kod ulaska, i pri jelu, šejtan kaže svojim prijateljima: 'Nema vam konaka, niti večere!\" A kada uđe, a ne spomene pri tom Uzvišenog Allaha, šejtan kaže: 'Našli ste konak!\" A ako ne spomene Uzvišenog Allaha ni kada pođe jesti, on (šejtan) kaže: 'Našli ste konak i večeru!'\" (Muslim)"
    },
    {
        "hadis": "Ebu-Bekr, r.a., pripovijeda: \"Jedan čovjek pohvalio je drugoga u prisustvu Allahovog Poslanika, a.s., i on mu reče, ponavljajući nekoliko puta: 'Teško tebi! Glavu si mu skinuo! Ako već nekoga morate hvaliti, onda recite: 'Ja ga takvog poznajem, a Allahu će polagati račun, i ni za koga ne tvrdim da je bezgriješan prema Allahu'\" (Muttefekun alejhi)"
    },
    {
        "hadis": "Od Ibn-'Abbasa, r.a., prenosi se da je rekao: \"Allahov Poslanik, s.a.v.s., rekao je:'Nema dana u kojima je dobro djelo draže Allahu od ovih! Znači, deset prvih dana zul-hidžeta.\" Oni su ga upitali: 'Pa čak ni džihad na Allahovom putu?\" On rekao je: 'Čak ni džihad, osim ako čovjek izađe sobom i svojim imetkom i ne vrati ništa od toga.'\" (Buhari)"
    },
    {
        "hadis": "Enes, r.a., prenosi da je Allahov Poslanik, a.s., rekao: \"Nemojte se međusobno mrziti, nemojte jedni drugima zavidjeti i okretati leđa, i nemojte jedni druge izbjegavati, nego, robovi Allahovi, budite braća! Vjerniku nije dozvoljeno napustiti svoga brata više od tri dana.\" (Muttefekun alejhi)"
    },
    {
        "hadis": "Nevas ibn Sem'an, r.a., prenosi da je Vjerovjesnik, a.s., rekao: \"Dobročinstvo je ljepota naravi, a grijeh je ono što se koleba u tvojoj duši i ne želiš da za to saznaju ljudi.\" - (Muslim)"
    },
    {
        "hadis": "Ebu-Musa el-Eš'ari, r.a., prenosi od Vjerovjesnika, s.a.v.s., da je rekao: \"Primjer onoga koji zikir čini (spominje svoga Gospodara) i onoga koji Ga ne spominje je kao primjer živog i mrtvog.\" (Buhari, Muslim)"
    },
    {
        "hadis": "Prenosi se da je Ebu-Hurejre, r.a., rekao: \"Allahovom Poslaniku (sallallahu ‘alejhi ve selleme) došao je jedan čovjek i upitao ga: ‘O Allahov Poslaniče! Ko je najpreči za moje lijepo druženje i ponašanje prema njemu?' Alejhisselam reče: 'Tvoja majka.' Čovjek tada reče: ‘ Ko poslije nje?' 'Tvoja majka', odgovori on. 'Ko poslije nje?', ponovo upita čovjek. 'Tvoja majka', ponovo odgovori Alejhisselam. Čovjek ponovo upita: ‘ Ko poslije nje?' Alejhisselam tada reče: 'Tvoj otac!'\" - (Muttefekun alejhi)"
    },
    {
        "hadis": "Enes, r.a., prenosi da je Allahov Poslanik, sallallahu 'alejhi ve selleme, rekao: \"Zaista je Allah, dž.š., zadovoljan čovjekom koji, kada nešto pojede, zahvali Allahu, dž.š., na tome ili kada nešto (od dozvoljenih pića) popije, zahvali Allahu, dž.š., na tome.\" - (Muslim)"
    },
    {
        "hadis": "Aiša, r.a., prenosi da je Allahov Poslanik, sallallahu 'alejhi ve selleme, rekao: \"Ako se nekome od vas zadrijema za vrijeme (nafile) namaza, neka odspava dok ga drijem ne prođe. Jer, uistinu, taj nije siguran da neće umjesto traženja oprosta sam sebe grditi.\" (Ne znajući šta radi, zbog nesanice.) - (Muttefekun alejhi)"
    },
    {
        "hadis": "Ebu-Se'id el-Hudri, r.a., veli da je čuo Allahova Poslanika, sallallahu ‘alejhi ve selleme, kada je rekao: \"Ko od vas vidi neko loše djelo, neka ga izmijeni (ukloni) svojom rukom (prisilno), a ako ne bude u stanju, neka to uradi riječima (neka naredi da se ukloni), a ako ni to ne bude u stanju, neka ga bar srcem svojim prezre, a to je najslabiji čin imana.\" - (Muslim)"
    },
    {
        "hadis": "Osman b. 'Affan, r.a., pripovijeda da je čuo Allahova Poslanika, sallallahu 'alejhi ve selleme, kad kaže: \"Ko klanja jaciju u džematu, kao da je klanjao pola noći, a ko klanja sabah u u džematu, kao da je klanjao cijelu noć.\" (Muslim)"
    },
    {
        "hadis": "Džerir b. Abdullah, r.a., pripovijeda: \"Kada smo jedne noći sjedili sa Allahovim Poslanikom, a.s., on pogleda u puni Mjesec i reče: 'Vi ćete vidjeti vašeg Gospodara jasno kao što vidite ovaj Mjesec, a gledajući u Njega, nećete osjetiti tegobu.'\" (Muttefekun alejhi)"
    },
    {
        "hadis": "Ebu-Mes'ud el-Bedri, r.a., prenosi da je Allahov Poslanik, sallallahu 'alejhi ve selleme, rekao: \"Kada čovjek utroši novac za izdržavanje svoje obitelji, želeći njime postići Allahovo zadovoljstvo (znajući da mu je to dužnost od Allaha, te je izvršava nadajući se Njegovoj nagradi), piše mu se kao da je podijelio sadaku.\" - (Muttefekun alejhi)"
    },
    {
        "hadis": "Ibn-'Abbas, r.a., prenosi da je Allahov Poslanik, sallallahu 'alejhi ve selleme, imao običaj učiti slijedeću dovu: \"Allahu dragi, Tebi se pokoravam, Tebe vjerujem, u Tebe se uzdam, Tebi se smjerno obraćam i samo se u ime Tvoje borim i parničim (prepirem), Allahu moj, utječem se Tvome dostojanstvu, nema drugog boga osim tebe, da me sačuvaš od zablude; Ti si vječno Živi, Besmrtni, a svi džini i ljudi (nevidljiva i vidljiva stvorenja) jesu smrtnici.\" - (Muttefekun alejhi)"
    },
    {
        "hadis": "Osman b. 'Affan, r.a., prenosi da je Resulullah, sallallahu 'alejhi ve selleme, rekao: \"Najbolji među vama je onaj koji Kur'an nauči, a zatim njemu druge poučava.\" (Buhari)"
    },
    {
        "hadis": "Od Ebu-Katade, r.a., prenosi se da je rekao: \"Čuo sam Allahova Poslanika,s.a.v.s., kako kaže: 'Ko želi da ga Allah sačuva od muka Sudnjeg dana, neka odgodi siromašnom (insolventnom) vraćanje duga, ili neka ga otpiše.'\" (Muslim)"
    },
    {
        "hadis": "Ibn-Mes'ud, r.a., prenosi da je Allahov Poslanik, sallallahu 'alejhi ve selleme rekao: \"Zaista je Džennet svakome od vas bliži od (sveze) njegove obuće, a i Džehennem isto tako.\" - (Buhari)   "
    },
    {
        "hadis": "Od Ebu-Hurejrea, r.a., prenosi se da je Vjerovjesnik, s.a.v.s., rekao: \"Kada neko od vas zaboravi, pa jede, ili se napije, neka dovrši svoj post, jer ga je to, zaista, Allah nahranio i napojio. (Muttefekun alejhi)"
    },
    {
        "hadis": "Ebu-Hurejre, r.a., prenosi da je Allahov Poslanik, sallallahu 'alejhi ve selleme, rekao: \"Jak vjernik bolji je i Allahu draži od nejaka vjernika, a u obojici je hajr (dokle god su vjernici). Žudi za onim što će ti koristiti, od Allaha pomoć traži i nemoj biti kukavica. Ako te šta neprijatno zadesi, nemoj reći: 'Da sam uradio drugačije, ne bi do ovoga došlo,' nego reci: 'Allah je odredio ono što je htio, i to i uradio, jer riječ \"da\" (sam) otvara šejtanska vrata.\" - (Muslim)"
    },
    {
        "hadis": "Ebu-Derda', r.a., kazuje da je čuo Allahovog Poslanika, a.s., kada kaže: \"Kada god musliman moli Allaha za svog brata muslimana u njegovom odsustvu, melek mu odgovori:'I tebi isto!'\" (Muslim)"
    },
    {
        "hadis": "Aiša, r.a., prenosi da je Allahov Poslanik, a.s., rekao: \"Nemojte govoriti: 'Zlo mi je!',nego recite: 'Mučno mi je!'\" (Muttefekun alejhi)"
    },
    {
        "hadis": "Od majke pravovjernih, Ummu Habibe Remle bint Ebi-Sufjan, r.a., prenosi se da je rekla: \"Čula sam Allahova Poslanika, s.a.v.s., kako kaže: 'Nema nijednoga (Allahova) roba - muslimana, koji svaki dan klanja Uzvišenom Allahu dvanaest rekata nafile, osim farzova, a da mu neće Allah sagraditi kuću u Džennetu!\" Ili reče: ' ... a da mu neće biti sagrađena kuća u Džennetu!'\" (Muslim)"
    },
    {
        "hadis": "Od Ebu-Hurejrea, r.a., prenosi se da je Allahov Poslanik, s.a.v.s., rekao: \"Uzvišeni Allah kaže: 'Ja sam uz mišljenje moga roba o Meni. Ja sam s njim kada Mi zikir čini (spominje), pa ako Me spomene u sebi, i Ja njega spomenem u Sebi, a ako Me spomene u skupini, Ja ga spomenem u boljoj skupini od njegove skupine.'\" (Muttefekun alejhi)"
    },
    {
        "hadis": "Ebu-Hurejre, r.a., prenosi da je Allahov Poslanik, a.s., rekao: \"Čovjeku je određeni udio u bludu, što će on neminovno i učiniti: blud očiju je pogled, blud ušiju je slušanje, blud jezika je govor, blud ruku je dodir, blud nogu je koračanje, duša želi i nada se, a spolni organ to sve potvrđuje ili negira.\" (Muttefekun alejhi)"
    },
    {
        "hadis": "Ebu-Hurejre, r.a., prenosi da je Allahov Poslanik, sallallahu 'alejhi ve selleme, rekao: \"Ko vjeruje u Allaha i Sudnji dan, neka ničim ne uznemirava komšiju! Ko vjeruje u Allaha i Sudnji dan, neka lijepo ugosti svoga gosta! Ko vjeruje u Allaha i Sudnji dan, neka govori hajr (korisno), ili neka šuti!\" - (Muttefekun alejhi)"
    },
    {
        "hadis": "Ebu-Hurejre, r.a., veli da je Allahov Poslanik, s.a.v.s., rekao: \"Sa trojicom Allah neće na Sudnjem danu govoriti, niti će ih očistiti (od grijeha), niti će u njih pogledati, i oni će biti strašno kažnjeni, a to su: starac koji čini zinaluk (prostituciju), vladar koji mnogo laže, i oholi siromah.\" - (Muslim)"
    },
    {
        "hadis": "Ibn-'Umer, r.a., prenosi da je Allahov Poslanik, sallallahu ‘alejhi ve selleme, rekao: \"Svi ste vi pastiri, i svaki pastir bit će odgovoran za svoje stado. Vladar je pastir, čovjek je pastir svojoj porodici, žena je pastirica u kući svoga muža i njegove djece. Svi ste vi, dakle, pastiri i svi ste odgovorni za svoje stado.\" (Muttefekun alejhi)"
    },
    {
        "hadis": "Od Ma'kil bin Jesara, r.a., prenosi se da je rekao: \"Allahov Poslanik, s.a.v.s.,rekao je: 'Ibadet u vrijeme anarhije i fitneta je kao hidžra meni.'\" (Muslim)"
    },
    {
        "hadis": "Ebu-Zerr, r.a., pripovijeda da su neki ljudi rekli: \" O Allahov Poslaniče, imućni ljudi odnesoše (Allahove) nagrade, klanjaju se kao i mi, poste kao i mi, i pored toga od viška svoga imetka udjeljuju sadaku.\" On im tada reče: \"Zar Allah, dž.š., nije i vama omogućio da sadaku dijelite? Svaki tesbih je sadaka, svaki tekbir je sadaka, svako \"elhamdu lillahi\" je sadaka, svaki izgovoren šehadet je sadaka, naredivanje na dobro je sadaka i sprečavanje zla je sadaka, pa čak i bračni odnos je sadaka.\" Oni tada rekoše: \"Allahov Poslaniče, zar i za zadovoljavanje svoje strasti čovjek ima nagradu?\" Alejhisselam reče: 'Šta mislite, kada bi tu svoju strast čovjek udovoljio na nedozvoljen način, bi li zaslužio kaznu? Isto tako, ako to uradi na dozvoljen (halal) način, zaslužuje nagradu.\" - (Muslim)"
    },
    {
        "hadis": "Džabir, r.a., prenosi da je Allahov Poslanik, a.s., rekao: \"Pokrijte posuđe s hranom, zavežite mješine s vodom, zatvorite vrata i pogasite svjetiljke, jer tada šejtan ne može ući u mješinu, otvoriti vrata ili otkriti posudu. A ako ne možete ništa drugo učiniti, onda preko posude stavite štap, stavite ga i spomenite Allahovo ime, jer i miš može ukućanima zapaliti kuću.\" (ako prevrne lampu i sl.) (Muslim)"
    },
    {
        "hadis": "Ebu-Hurejre, r.a., prenosi da je Allahov Poslanik, s.a.v.s., rekao: \"Požurite sa dobrim djelima, jer će se pojavljivati smutnje koje će nastupati kao dijelovi mrkle noći; čovjek će osvanuti kao vjernik, a omrknuti kao nevjernik, ill će omrknuti kao vjernik, a osvanuti kao nevjernik - prodavat će svoju vjeru za dunjalučke stvari.\" - (Muslim)"
    },
    {
        "hadis": "Ebu-Se'id el-Hudri, r.a., prenosi da je Allahov Poslanik, a.s., rekao: \"Čuvajte se sjedenja po javnim putevima!\" \"Allahov Poslaniče, nama je potrebno da se tu okupljamo i razgovaramo!\", rekoše. \"Ako se tu već morate sakupljati, onda dadnite putu njegovo pravo!\" \"A što je pravo puta, Allahov Poslaniče?\" \"Obaranje pogleda, neuznemiravanje drugih, odvraćanje selama i naređivanje dobra, a odvraćanje od zla.\" (Muttefekun alejhi)"
    },
    {
        "hadis": "Nu'man b. Bešir,r.a., pripovijeda da ga je otac doveo Allahovom Poslaniku, a.s., i rekao mu: \"Ovome sinu sam poklonio slugu!\" \"Jesi li svakom djetetu poklonio isto što i njemu?\", upita ga. \"Nisam!\", odgovori mu. \"Vrati taj poklon!\", naredi mu Allahov Poslanik,a.s. (Muttefekun alejhi)"
    },
    {
        "hadis": "Usame b. Zejd, r.a., prenosi da je Allahov Poslanik, a.s., rekao: \"Uzvratio je punom mjerom onaj ko kaže onome ko mu učini dobročinstvo: 'Allah te nagradio svakim dobrom!' (Džezakellahu hajra)\" (Tirmizi, hasen, sahih)"
    },
    {
        "hadis": "Bera', r.a., prenosi da je Allahov Poslanik, sallallahu 'alejhi ve selleme, rekao: \"Kada se dva muslimana sretnu pa se rukuju, oprošteni su im (manji) grijesi, prije nego što se rastanu.\" (Ebu-Davud, hasen)"
    },
    {
        "hadis": "Od Ebu-Hurejrea, r.a., prenosi se da je rekao: \"Allahov Poslanik, s.a.v.s., rekao je: 'Dvije lahke riječi za jezik (izgovor), teške na vagi, drage Milostivom: - Subhanallahi ve bihamdihi, subhanallahil'azim -\" (Neka je slavljen i hvaljen Uzvišeni Allah, neka je slavljen Allah Veličanstveni).'\" (Muttefekun alejhi)"
    },
    {
        "hadis": "Ebu-Hurejre, r.a., prenosi da je Allahov Poslanik, a.s., rekao: \"Vrata Dženneta otvaraju se svakoga ponedjeljka i četvrtka, i oprosti se svakom robu koji Allahu ne pripisuje druga, izuzev onoga ko je zavađen sa svojim bratom muslimanom. Tada se kaže: 'Sačekajte ovu dvojicu dok se izmire, sačekajte ovu dvojicu dok se izmire!\" (Muslim)"
    },
    {
        "hadis": "Ebu-Sabit, ili Ebu-Seid, ili Ebu el-Velid (razilaze se u njegovom nadimku), Sehl ibn Hunejf, koji bijaše učesnik Bitke na Bedru, prenosi da je Allahov Poslanik, sallallahu 'alejhi ve selleme, rekao: \"Ko iskreno od Allaha traži šehadet (da pogine kao šehid), Allah će mu podariti stepen šehida, pa makar umro i u svojoj postelji (a ne na bojnom polju).\" - (Muslim)"
    },
    {
        "hadis": "Ebu-Hurejre, r.a., prenosi od Vjerovjesnika, s.a.v.s., da je rekao: \"Urođenih svojstava ima pet, ili pet stvari su fitra (urođene osobine): sunećenje (obrezivanje), uklanjanje dlaka sa stidnih mjesta, podrezivanje nokata, čupanje dlaka ispod pazuha, te podrezivanje brkova.\" (Muttefekun alejhi)"
    },
    {
        "hadis": "Ebu-Musa, r.a., prenosi da je Allahov Poslanik, sallallahu 'alejhi ve selleme, rekao: \"Svaki je musliman dužan podijeliti sadaku.\" Neko reče: \"A šta ako je nema?\" \"Zarađivat će svojim rukama, i tako sebi privređivati, a i sadaku dijeliti\", odgovori on. \"A šta ako ne bude mogao?\" \"Pomoći će nevoljniku koji je u nuždi.\" \"A šta ako ne bude mogao?\" \"Naređivat će na dobro i korisno.\" \"A šta ako ni to ne bude radio?\" \"Suzdržavat će se od zla, jer mu je i to sadaka.\" - (Muttefekun alejhi)"
    },
    {
        "hadis": "Ebu-Hurerje, r.a., prenosi da je Allahov Poslanik, a.s., rekao: \"Žene se uzimaju zbog četiri stvari: zbog bogatstva, porijekla, ljepote i vjere; pa se oženi vjernicom, blagoslovljen bio!\" - (Muttefekun alejhi)"
    },
    {
        "hadis": "Aiša, r.a., kazuje da je Allahov Poslanik, a.s., poslao jednog čovjeka kao zapovjednika izvidnice. Čovjek je na završetku svakog namaza učio suru (Kul huvallahu ehad), a kada se vratiše, to spomenuše Allahovom Poslaniku, a.s. \"'Upitajte ga zašto je to činio?\" - reče im Allahov Poslanik, a.s. Kada su ga pitali, on im odgovori: \"Zato što su u toj suri svojstva Milostivog, i ja volim da je učim.\" \"Recite mu da ga Uzvišeni Allah voli, reče Allahov Poslanik, a.s.\" - (Muttefekun alejhi)"
    },
    {
        "hadis": "Ebu-Hurejre, r.a., prenosi da je Allahov Poslanik, sallallahu 'alejhi ve selleme, rekao: \"Zaista je vjera lagana, bez tegoba. Ko god u vjeri navaljuje s dodacima, vjera ga savlada. Zato se držite umjerenosti (sredine), a ako neko od vas ne bude u stanju neki posao obaviti u potpunosti, neka ga bar približno obavi. Budite radosni, i pomažite se jutrom, krajem dana i jednim dijelom noći.\" - (Buhari) U jednom drugom njegovom rivajetu stoji: \"Budite umjereni, budite umjereni, činite ibadet jutrom i večeri i krajem noći, postići ćete ciljeve.\" Opće značenje ovog hadisa: Olakšajte sebi obavljanje (vanrednih) ibadeta i dobrih djela, tako što ćete ih obavljati u vremenu kad ste raspoloženi i za njih horni, tako da vam budu dragi i ugodni, a ne teški i odvratni, da biste postigli vaš cilj. Budite kao iskusni putnik koji koristi vrijeme svoje aktivnosti (rano ujutro, kraj dana i jedan dio noći) za putovanje, a ostali dio vremena provodi u odmaranju, zajedno sa svojom jahalicom, i tako stiže do cilja, bez puno umora."
    },
    {
        "hadis": "Ebu-Hurejre, r.a., pripovijeda da je Allahov Poslanik, sallallahu ‘alejhi ve selleme, rekao: \"Ako neko od vas rukovodi (imami) ljudima u namazu, neka bude umjeren, neka im olakša, jer među njima ima slabih, bolesnih i starih. A kad klanja sam, neka odulji koliko hoće.\" U jednom rivajetu dodaje se: \"Medu njima, možda, ima i neko sa kakvom nuždom (potrebom).\" - (Muttefekun alejhi)"
    },
    {
        "hadis": "Ibn-'Abbas, r.a., veli da je čuo Vjerovjesnika, sallallahu 'alejhi ve selleme, kad kaže:\"Neka se čovjek nipošto ne osamljuje sa ženom (koja mu nije bliži rod), ako s njom nije njen mahrem (osoba za koju se ne može udati), a žena neka ne putuje bez mahrema!\" Neki čovjek mu reče: \"O Allahov Poslaniče, moja žena krenula je na hadž, a ja sam upisan za taj i taj pohod (vojnu)?\" Poslanik mu na to reče: \"Idi i hadž obavi sa svojom ženom!\" (Muttefekun alejhi)"
    },
    {
        "hadis": "Ebu-Hurejre, r.a., prenosi da je Allahov Poslanik, a.s., rekao: \"Nije dozvoljeno vjerniku da ga zmija ujede dva puta iz iste rupe.\" (tj. da dva puta pada u istu grešku) (Muttefekun alejhi)"
    },
    {
        "hadis": "Od Ebu-Hurejrea, r.a., se prenosi da je rekao: \"Čuo sam Allahova Poslanika, s.a.v.s., kako kaže: 'Ko obavi hadž, a ne bude nepristojne i ružne riječi govorio i ne bude kršio (Allahove) propise, vratit će se (bez grijeha) kao na dan kada ga je majka rodila.'\" (Muttefekun alejhi)"
    },
    {
        "hadis": "Džundub b. Abdullah, r.a., prenosi da je Allahov Poslanik, a.s., kazivao: \"Jedan čovjek se zaklinjao: 'Tako mi Allaha, Allah neće oprostiti tom i tom čovjeku!', pa mu je Allah odgovorio: 'Ko je taj što se zaklinje Mojim imenom da Ja neću oprostiti tome i tome? Njemu sam već oprostio, a tebi djela poništio!'\" (Muslim)"
    },
    {
        "hadis": "Enes, r.a., kazuje da je jedan beduin upitao Allahovog Poslanika, a.s.: \"`Kada će biti Smak svijeta?\"A šta si pripremio za njega?', upita ga. 'Ljubav prema Allahu i Allahovom Poslaniku', reče čovjek. 'Ti ćeš biti sa onima koje voliš' - odgovori mu.\" Drugo predanje glasi: \"Nisam pripremio mnogo dobrovoljnog posta, ni namaza, ni sadake, ali volim Allaha i Njegovog Poslanika!\" - (Muttefekun alejhi)"
    },
    {
        "hadis": "Ebu-Hurejre, r.a., prenosi da je Allahov Poslanik, a.s., rekao: \"Čuvajte se sumnji, jer sumnje su najlažnije pomisli.\" (Muttefekun alejhi)"
    },
    {
        "hadis": "Ummu Seleme, r.a., prenosi da je Allahov Poslanik, a.s., rekao: \"Kada se pojavi mlađak zul-hidžeta, nije dozvoljeno onome ko namjerava zaklati kurban, da skraćuje svoju kosu, bradu, niti da sječe nokte, sve dok ne zakolje kurban.\" (Muslim)"
    },
    {
        "hadis": "Prenosi se od Ukbet Ibn el-Harisa, r.a., da je rekao: \"Klanjao sam za Allahovim Poslanikom, s.a.v.s. ikindiju u Medini pa predade selam, a zatim žurno ustade, pa između svijeta ode u sobu jedne od njegovih žena. Ljudi su se prepali zbog njegove žurbe. Pošto on izađe, primijeti da su se ljudi začudili njegovoj žurbi i reče: 'Sjetio sam se da imam nešto zlata kod kuće, pa nisam želio da budem okupiran njime, pa sam požurio da naredim da se podijeli.'\" - (Buhari) U drugom rivajetu ovaj hadis citira se ovako: \"Ostavio sam u kući nešto zlata od sadake, pa ne želim da obnoći kod mene.\""
    },
    {
        "hadis": "Ijas ibn Sa'lebe el-Harisi, r.a., prenosi da je Allahov Poslanik, sallallahu ‘alejhi ve selleme, rekao: \"Ko uskrati, ili uzurpira pravo nekog čovjeka muslimana svojom (krivom) zakletvom, Allah mu je osigurao Džehennem, a zabranio mu je Džennet.\" Neki čovjek reče: \"Čak ako to bude i nešto beznačajno, Allahov Poslaniče!\" \"Makar to bila grančica misvaka (drveta)\", odgovori on. - (Muslim)"
    },
    {
        "hadis": "Ebu-Hurejre, r.a., prenosi da je Allahov Poslanik, sallallahu ‘alejhi ve selleme, rekao: \"Čovjek je dužan svakoga dana podijeliti sadaku za svaki članak (dio) svoga tijela. Pravilno riješiti spor izmedu dvojice sadaka je, pomoći čovjeku da zajaše svoga konja, ili mu pomoći da ga natovari sadaka je, prijatna i lijepa riječ sadaka je, svaki korak prema džamiji radi namaza sadaka je, i uklanjanje sa puta onoga što smeta sadaka je.\" - (Muttefekun alejhi)"
    },
    {
        "hadis": "Džabir, b. Semure, r.a., pripovijeda da je Allahov Poslanik, sallallahu 'alejhi ve selleme, istupio pred njih, pa im je rekao: \"Zar se nećete poredati u safove, kao što se meleki poredaju kod svoga Gospodara?\" \"A kako se meleki poredaju kod svoga Gospodara?\",upitasmo mi, a on odgovori: \"Upotpune prve safove i zbiju se u njima.\" (Muslim)"
    },
    {
        "hadis": "Od Ebu-Hurejrea, r.a., prenosi se da je Allahov Poslanik, s.a.v.s., rekao: \"Najbolji post, poslije ramazana, je u Allahovom mjesecu muharremu, a najbolji namaz, nakon farzova, je noćni namaz (kijamul-lejli).\" (Muslim)"
    },
    {
        "hadis": "Ebu-Hurejre, r.a., prenosi da je Allahov Poslanik, sallallahu 'alejhi ve selleme, rekao: 'Musliman je dužan prema svome bratu muslimanu petero: primiti mu selam, obići ga kad se razboli, dženazu mu ispratiti, odazvati mu se na poziv i kada kihne reći mu 'jerhamukellah' (Allah ti se smilovao).\" - (Muttefekun alejhi)"
    },
    {
        "hadis": "Ebu-Hurejre, r.a., veli da je Allahov Poslanik, sallallahu 'alejhi ve selleme, rekao: \"Kada čovjek umre, prekidaju se njegova djela, osim u tri slučaja: trajna sadaka, znanje kojim se (iza njega) koristi i dobro odgojeno dijete koje mu dovu čini.\" (Muslim)"
    },
    {
        "hadis": "Ibn-'Umer, r.a., prenosi da je Allahov Poslanik, sallallahu ‘alejhi ve selleme, rekao: \"Mu'min je trajno u prostranstvu svoje vjere (dina), sve dok nedozvoljeno ne prolije krv.\" - (Buhari)"
    },
    {
        "hadis": "Ebu-Hurejre, r.a., prenosi: \"Čuo sam Allahova Poslanika, s.a.v.s., kako kaže: 'Kada se prouči ikamet za namaz, nemojte na njega dolaziti trčeći, nego dolazite idući (korakom) i budite smireni. Ono što ste stigli, klanjajte, a ono što vas je prošlo, upotpunite.'\" (Muttefekun alejhi)"
    },
    {
        "hadis": "Adijj ibn Hatim et-Tai, r.a., prenosi da je Allahov Poslanik, sallallahu 'alejhi ve selleme, rekao: \"Ko se zakune da će nešto uraditi, zatim poslije uvidi nešto što je bogobojaznije (ispravnije od toga), neka uradi ono što je bogobojaznije.\" - (Muslim)"
    },
    {
        "hadis": "Omer ibn Hattab, r.a., pripovijeda: \"Jednog dana sjedili smo kod Allahovog Poslanika, sallallahu 'alejhi ve selleme, te se iznenada pojavi jedan čovjek izuzetno bijele odjeće, jako crne kose, bez ikakvih znakova putovanja na sebi, a niko od nas ga nije poznavao. Približi se Allahovom Poslaniku, sallallahu ‘alejhi ve selleme, i sjede pored njega, tako što je prislonio svoja koljena uz njegova i svoje ruke stavio na natkoljenice, a potom reče: 'O Muhammede, obavijesti me o islamu!' Allahov Poslanik, sallallahu ‘alejhi ve selleme, mu reče : 'Islam je da posvjedočiš da nema drugog boga, osim Allaha, i da je Muhammed Allahov poslanik, da obavljaš namaz, daješ zekat, postiš ramazan i da hodočastiš Bejtullah, ako si u mogućnosti.' On tada reče: 'Istinu si kazao.' Mi smo mu se čudili (veli Omer); pita ga, a zatim mu potvrđuje. Čovjek ponovo reče: 'Obavijesti me o imanu!' Alejhisselam kaza: ‘Iman je da vjeruješ Allaha, Njegove meleke, Njegove Knjige, Njegove poslanike, Sudnji dan i da vjeruješ da je sve određeno, bilo dobro, bilo zlo.' Čovjek opet reče: \"Istinu si kazao.' Zatim reče: ‘Obavijesti me o ihsanu (savršenstvu u vjeri)!' Alejhisselam mu kaza: 'Ihsan je da robuješ Allahu kao da ga vidiš, jer ako ti Njega ne vidiš, On tebe, zaista, vidi.' Zatim reče: ‘Obavijesti me o Kijametskom danu? 'Alejhisselam odgovori: 'Upitani o tome ne zna ništa više od onoga koji ga je upitao.' 'Obavijesti me o njegovim predznacima', reče čovjek. Alejhisselam reče: ‘Da robinja rodi sebi gospodaricu, da vidiš gole i bose čobane, čuvare stada kako se nadmeću u gradnji visokih palača.' Poslije toga je onaj čovjek otišao, a nakon izvjesnog vremena, Allahov Poslanik, sallallahu 'alejhi ve selleme, mi reče: 'O Omere, znaš li ko je bio onaj čovjek?' Ja mu odgovorih: 'Allah i Njegov Poslanik najbolje znaju.' On mi tada reče: 'To je bio Džibril, došao je da vas poduči vašoj vjeri.'\" - (Muslim) O značenju Poslanikovih riječi \"da će robinja roditi sebi gospodaricu\" ima više mišljenja. Jedno od njih je da će se svijet toliko pokvariti da će djeca postupati sa svojim roditeljima, kao što gospodar postupa sa svojim robom."
    },
    {
        "hadis": "Ibn-Mes'ud, r.a., prenosi da je Allahov Poslanik, sallallahu 'alejhi ve selleme, rekao: \"Ko prouči jedan harf - slovo iz Allahove Knjige (Kur'ana), imat će nagradu, a nagrada sedesetorostruko uvećava. Ja ne kažem da je 'Elif-Lam-Mim' jedan harf, nego 'Elif' je harf,'Lam' je harf i 'Mim' je harf.\" (Tirmizi, hasen, sahih)"
    },
    {
        "hadis": "Ebu-Hurejre, r.a., prenosi da je Allahov Poslanik, sallallahu 'alejhi ve selleme,rekao: \"Nije dozvoljeno ženi, koja vjeruje u Allaha i Sudnji dan, krenuti na put od jednog dana i noći (dužine dana i noći), bez mahrema rođaka za koga se ne može udati.\" (Muttefekun alejhi)"
    },
    {
        "hadis": "Ebu-Zerr, r.a., kazuje da je čuo Allahovog Poslanika, a.s., kada je rekao: \"Ko muslimanu kaže: 'Kafire!', ili: 'Allahov neprijatelju!', a on, doista, ne bude takav, njegove riječi vratiti će se njemu.\" (Muttefekun alejhi)"
    },
    {
        "hadis": "Ebu el-Jekazan 'Ammar ibn Jasir, r.a., prenosi: \"Čuo sam Allahova Poslanika, s.a.v.s., kako kaže: 'Zaista, dužina čovjekovog namaza i kratkoća hutbe (vaza) znak je njegove učenosti i razumijevanja, pa oduljite namaz, a skratite hutbu.'\" (Muslim)"
    },
    {
        "hadis": "Ebu-Hurejre, r.a., prenosi daje Allahov Poslanik, sallallahu 'alejhi ve selleme, rekao: \"Ne zavidite jedan drugom, ne podižite cijenu robe (ne želeći je kupiti) jedan drugom, ne mrzite se međusobno, ne okrećite jedan drugom leđa (ne svađajte se), ne namećite se u kupovini, nego budite prava braća, Allahovi iskreni robovi. Musliman je muslimanu brat; on ga neće oštetiti, niti potcijeniti, niti ga na cjedilu ostaviti. Takvaluk je ovdje, i pokaza na svoje grudi, tri puta. Dosta je čovjeku zla da omalovažava svoga brata muslimana. Sve što je vezano za muslimana haram je drugom muslimanu: njegova krv, njegov imetak i njegova čast.\" - (Muslim)"
    },
    {
        "hadis": "Ebu-Hurejre, r.a., kazuje da je Allahov Poslanik, a.s., rekao: \"Ko vjeruje u Allaha i Sudnji dan, neka govori ono što je dobro, ili neka šuti.\" (Muttefekun alejhi)"
    },
    {
        "hadis": "Prenosi se da je Huzejfe r.a., rekao: \"Kada bi Resulullah, sallallahu 'alejhi veselleme, noću legao u postelju, stavio bi (desnu) ruku ispod obraza i rekao: 'Bože moj, s Tvojim imenom umirem i s Tvojim imenom živim\", a kada bi se probudio rekao bi: 'Hvala Allahu, koji nas je oživio, nakon što nas je usmrtio (nakon sna) i Njemu ćemo se ponovo vratiti!'\" (Buhari)"
    },
    {
        "hadis": "Od Ebi-Seida el-Hudrija, r.a., prenosi se da je Allahov Poslanik, s.a.v.s., rekao: \"Kada se spremi dženaza i kada je svijet, tj. ljudi, ponesu na svojim ramenima, ukoliko je dobra, reći će: \"Požurite sa mnom!\" A ako ne bude dobra, reći će: \"Teško njoj, kuda ćete s njom (Teško meni kuda ćete sa mnom)?\" Njen glas čuje svako, osim čovjeka, a kada bi ga čuo, pao bi u nesvijest.\" - (Buhari)"
    },
    {
        "hadis": "Od Ebu-Hurejrea, r.a., prenosi se da je neki čovjek došao Vjerovjesniku, s.a.v.s., i tražio od njega dug vrlo osorno, pa su skočili ashabi prema njemu, a Allahov Poslanik rekao je: \"Pustite ga, zaista onaj ko ima pravo (na nešto), ima pravo i prigovora\", a zatim rekao je: \"Dajte mu devu koja ima isto godina, kao i njegova!\" Tada ashabi rekoše: \"O Allahov Poslaniče, ne možemo naći nego stariju (i bolju) od njegove\", a on im reče: \"Dajte mu je! Zaista je najbolji među vama onaj koji je najrevniji i najbolji u vraćanju duga!\" (Muttefekun alejhi)"
    },
    {
        "hadis": "Ebu-Musa r.a., prenosi da je Allahov Poslanik, sallallahu 'alejhi ve selleme, rekao: \"Brinite se i čuvajte ovaj Kur'an (ono što ste naučili iz njega), jer, tako mi Onoga u čijoj je ruci Muhammedova duša, on se zaboravlja brže nego što se deva oslobodi sveze (konopa kojim joj je noga svezana). (Muttefekun alejhi)"
    },
    {
        "hadis": "Ebu Hurejre, r.a., prenosi da je Allahov Poslanik, s.a.v.s., rekao: \"Zaista Allah ne gleda u vaša tijela, niti u vaše likove, nego gleda u vaša srca i vaša djela.\" (Muslim)"
    },
    {
        "hadis": "Ebu-Se'id el-Hudri, r.a., prenosi da je Allahov Poslanik sallallahu alejhi ve selleme, rekao: \"Davno prije vas, bio je jedan čovjek koji je ubio 99 osoba, pa je upitao za najučenijeg čovjeka na svijetu, te su ga uputili na jednog rahiba (isposnika). On ode do spomenutog rahiba i kaže mu da je ubio 99 osoba, pa ga onda upita, ima li za njega oprosta kod Allaha, dž.š. Na to mu rahib reče da za njega nema oprosta. Čovjek se na to podiže i ubi i rahiba i napuni stotinu ubijenih. Zatim je ponovo upitao za najučenijeg čovjeka na svijetu, pa ga uputiše na jednog učenjaka, kome je on ispričao da je ubio 100 osoba, a zatim ga upitao ima li za njega takvog tevbe? Učenjak mu na to reče: Svakako. Ko te sprečava da učiniš tevbu? Idi u tu i tu zemlju, u njoj stanuju ljudi koji iskreno Allahu robuju, pa im se i ti pridruži u njihovom robovanju, i nipošto se ne vraćaj u svoju sredinu, jer je ona pokvarena. Čovjek se uputi ka toj zemlji, ali ga negdje na pola puta zadesi smrt. Oko njega nastade spor između meleka milosti i meleka kazne. Meleci milosti rekoše: 'On je došao kao pokajnik od grijeha i srcem svojim okrenut prema Allahu!' Meleki kazne rekoše: 'On nikada nije učinio ni jedno dobro djelo!' Tada melecima stiže jedan drugi melek, u ljudskom liku, koga oni uzeše za sudiju da im presudi. Melek-sudija im reče: 'Izmjerite rastojanje između jednog i drugog mjesta, pa kojem od njih bude bliži, njemu i pripada.' Meleki izmjeriše rastojanje i ustanoviše da je bliži zemlji kojoj je bio krenuo, te ga uzeše meleki milosti.\" U Buharijinom rivajetu, stoji: \"Bio je bliži zemlji dobra samo za jedan pedalj, te je zbog toga postao njen.\" A u sljedećem od Buharijinih rivajeta stoji: \"Pa je Allah dž.š. naredio zemlji dobra da se približi, a zemlji grijeha da se udalji; zatim je naredio melecima da izmjere rastojanje između njih. Meleki to uradiše i nađoše da je bliži zemlji dobra samo za jedan pedalj, te mu Allah dž.š. oprosti njegove grijehe.\" A u jedno rivajetu se kaže da se on umirući pokušao približiti zemlji dobra, tako što se posljednjom snagom nageo prema zemlji dobra, te je to bio uzrok da joj je bio bliži. -(Muttefekun alejhi)"
    },
    {
        "hadis": "Amr b. 'As, r.a., prenosi da je čuo Allahovog Poslanika, a.s., kada kaže: \"Kada sudija uloži trud u presudi i pravedno presudi, ima dvostruku nagradu, a kada uloži trud u presudi i pogrešno presudi, ima jednu nagradu.\" (Muttefekun alejhi)"
    },
    {
        "hadis": "Ibn Mes'ud, r.a., prenosi da je Allahov Poslanik, sallallahu 'alejhi ve selleme, rekao: \"Propali i stradali su cjepidlake!\" (Oni koji bez razloga sebi i drugima otežavaju poslove i ibadete.) Rekao je to tri puta. (Muslim)"
    },
    {
        "hadis": "Ebu-Hurejre, r.a., prenosi da je Allahov Poslanik, sallallahu ‘alejhi ve selleme, rekao: \"Zbrinjavalac (siromašne) udovice i siromaha je kao mudžahid (borac) na Allahovom putu.\" A mislim (veli ravija), da je još dodao: \"I kao neprekidni klanjač koji se ne umara, i kao stalni postač koji nikako ne mrsi!\" (Muttefekun alejhi)"
    },
    {
        "hadis": "Ebu-Ejjub el-Ensari, r.a., pripovijeda da je neki čovjek rekao: \"O Allahov Poslaniče! Obavijesti me o poslu koji će me uvesti u Džennet i udaljiti od Džehennema. Allahov Poslanik, sallallahu 'alejhi ve selleme, reče mu na to: 'Ibadet čini isključivo Allahu, dž.š., i ne pripisuj Mu druga, namaz redovno obavljaj, daji zekat i pazi i posjećuj svoju rodbinu.\"' - (Muttefekun alejhi)"
    },
    {
        "hadis": "Od Ebu-Hurejrea, r.a.,se prenosi da je rekao: \"Allahov Poslanik, s.a.v.s., je rekao: ‘Nema nijednog dana u kojem osvanu robovi, a da ne siđu dva meleka pa jedan govori: - Allahu moj, nadoknadi onome ko daje - a drugi govori: - Allahu moj, daj propast onome koji ne daje.\"' - (Muttefekun alejhi)"
    },
    {
        "hadis": "Ebu-Umame, r.a., prenosi da je čuo Allahova Poslanika, sallallahu 'alejhi ve selleme, kad kaže: \"Učite Kur'an, jer će on doći na Sudnjem danu da se zauzima (šefaat čini) za svoje učače.\" (Muslim)"
    },
    {
        "hadis": "Ibn-Omer, r.a., prenosi da je Allahov Poslanik, a.s., ugledao dječaka kome su obrijali samo jedan dio glave. Allahov Poslanik, a.s., zabranio im je to, rekavši: \"Ili mu obrijte cijelu glavu, ili je ne dirajte!\" (Ebu-Davud, sahih aened)"
    },
    {
        "hadis": "Abdullah b. Amr b. el-As, r.a., pripovijeda da je Allahov Poslanik, s.a.v.s., rekao: \"Allah će oprostiti šehidu sve osim duga.\" U drugom njegovom rivajetu stoji: \"Pogibija na Allahovom putu briše svaki grijeh osim duga.\" (Muslim)"
    },
    {
        "hadis": "Ibn-Mes'ud, r.a., prenosi da je Allahov Poslanik, a.s., rekao: \"Ja znam čovjeka koji će zadnji izaći iz Džehennema i zadnji ući u Džennet. Iz vatre će izaći pužući i Allah ćemu reći: 'Idi, i uđi u Džennet!' Kada ode, pričinit će mu se da je pun, vratit će se i reći: 'Gospodaru, Džennet se ispunio!' Allah će mu opet reći: 'Idi, i uđi u Džennet!' Kada ode pričinit će mu se da je pun, vratit će se i reći: 'Gospodaru, Džennet se ispunio!' 'Idi, i uđi u Džennet!', Allah će mu ponovo reći. 'U njemu ćeš imati deset puta koliko ovaj svijet.' 'Zar mi se rugaš i ismijavaš me, a Ti si Vladar?'\" Prenosilac hadisa dalje kazuje: \"Allahov Poslanik, a.s., nasmija se i ukazaše mu se bijeli zubi, pa reče: 'To je čovjek najnižeg stupnja u Džennetu!'\" (Muttefekun alejhi)"
    },
    {
        "hadis": "Ebu-Hurejre, r.a., prenosi da je Allahovom Poslaniku, sallallahu ‘alejhi ve selleme, doveden jedan čovjek koji je pio alkohol, pa je rekao: \"Udrite ga.\" \"Mi smo ga udarali čime je ko stigao, neko rukom, neko obućom, a neko čak i svojom odjećom\", veli Ebu-Hurejre. A kada je to sve bilo završeno i čovjek se udaljio, neko reče: \"Allah te posramio!\" Alejhisselam reče: \"Ne govorite tako, ne pomažite šejtanu protiv njega.\" - (Buhari)"
    },
    {
        "hadis": "Ebu-Hurejre, r.a., pripovijeda: \"Došao je jedan čovjek i rekao Allahovom Poslaniku,a.s.: 'Allahov Poslaniče, koliko sam bola pretrpio od kako me je sinoć ujeo akrep!!' 'Ne bi ti naudio da si navečer proučio: 'E'uzu bi kelimatillahitta mmati min šerri ma halek' (Utječem se Allahovim savršenim riječima od svakog zla koje je stvorio).'\" (Muslim)"
    },
    {
        "hadis": "Ebu-Hurejre, r.a., prenosi da je Allahov Poslanik, a.s., rekao: \"Čuvajte se zavisti, jer zavist uništava dobra djela, kao što vatra uništava drva.\" (Ebu-Davud)"
    },
    {
        "hadis": "Prenosi se da je Enes, r.a., rekao: \"Vi, zaista, radite poslove koji su u vašim očima (po vašem mišljenju) manji od dlake, a mi smo ih u vrijeme Allahovog Poslanika, sallallahu 'alejhi ve selleme, smatrali upropašćujućim (velikim) grijesima.\" - (Buhari)"
    },
    {
        "hadis": "Ebu-Hurejre, r.a., prenosi da je Allahov Poslanik, s.a.v.s., rekao: \"Dvije vrste stanovnika Džehennema neću vidjeti: ljude sa bičevima u rukama, koji su kao kravlji repovi, i njima udaraju ljude; i žene, obučene a otkrivene, koje zanose u hodu, i druge tome pozivaju,i okrenute od pokornosti Allahu, glave im kao krive grbe deve. One neće ući u Džennet niti će osjetiti njegova mirisa, a zasigurno se njegov miris osjeća na ogromnoj daljini.\" (Muslim)"
    },
    {
        "hadis": "Od Ebu-Hurejrea, r.a., prenosi se da je rekao: \"Pitao je Poslanik, s.a.v.s.: 'Hoćete li da vas uputim na ono čime će vam Allah izbrisati grijehe i povećati vaš stupanj?' Rekoše: 'Hoćemo, o Allahov Poslaniče.' On reče: 'Temeljno uzimanje abdesta u najtežim uslovima, mnogo koraka do mesdžida i iščekivanje namaza poslije namaza, vam je kao pripravnost za džihad.'\" - (Muslim)"
    },
    {
        "hadis": "Abdullah Ibn-'Abbas, r.a., prenosi da je Allahov Poslanik, sallallahu 'alejhi ve selleme,rekao: “Allah, dž.š., odredio je dobra i loša djela, zatim to objasnio; pa ko bude odlučio učiniti dobro djelo, zatim ga ne učini (bude spriječen), Allah mu to djelo u cijelosti upisuje kao da ga je i učinio, a ako odluči učiniti dobro djelo, pa ga i učini, Allah mu ga upisuje deset do sedam stotina puta, pa čak i više. A ako zaželi učiniti neko loše djelo, pa ga ne učini, Allah mu upisuje jedno dobro djelo, a ako zaželi učiniti neko loše djelo, pa ga i učini, Allah mu upisuje samo jedno loše djelo.” (Muttefekun alejhi)"
    },
    {
        "hadis": "Ebu-Se'id el-Hudri prenosi da je čuo od Vjerovjesnika, sallallahu 'alejhi ve selleme, ove riječi: \"Kada neko od vas vidi san koji mu se dopadne, neka zna da je od Allaha, dž.š., pa neka Mu se zahvali i neka ga ispriča!\" U jednom drugom rivajetu, stoji: \"Neka ga ispriča samo onome koga voli, a ako vidi nešto drugo, što mu se ne dopadne, neka zna da je to od šejtana, pa neka zatraži utočište (zaštitu) kod Allaha od njegova zla i neka ga nikom ne spominje, pa mu neće nauditi.\" (Muttefekun alejhi)"
    },
    {
        "hadis": "Ibn-Mes'ud, r.a., prenosi da je Allahov Poslanik, a.s., rekao: \"Nije dozvoljeno ženi koja se druži sa nekom ženom, da tu ženu opisuje svome mužu, kao da je on sam gleda.\" (Muttefekun alejhi)"
    },
    {
        "hadis": "Od Sehla bin Sa'da, r.a., prenosi se da je Vjerovjesnik, s.a.v.s., rekao Aliji, r.a.: \"Pa, tako mi Allaha, da Allah tvojim uzrokom uputi jednog čovjeka, bolje ti je od crvenih (najboljih) deva.\" (Muttefekun alejhi)"
    },
    {
        "hadis": "Aiša, r.a., prenosi od Allahova Poslanika, sallallahu 'alejhi ve selleme, da je rekao: \"Svakom mejitu, kojem dženazu klanja skupina od stotinu (ili više) muslimana, i svi se za njega zauzmu (šefaat učine), zauzimanje će biti primljeno.\" (Muslim)"
    },
    {
        "hadis": "Džundub ibn Džunade Ebu-Zerr, r.a., pripovijeda da je rekao: \"O Allahov Poslaniče, koji je posao najbolji?\" On mi reče: \"Vjerovanje u Allaha i borba na Njegovom putu.\" Zatim sam ga upitao: \"Kakav (koji) je rob najbolji?\" (za kojeg bih imao najveću nagradu ako ga oslobodim.) \"Najbolji rob je onaj koji je najcjenjeniji kod svoga gospodara i najskuplji po procjeni\", odgovori on. Zatim sam mu rekao: \"A ako ne uradim (ništa od toga)?\" \"Onda pomozi drugoga u njegovom poslu, ili uradi onome koji nije u stanju uraditi što je započeo\", reče on. Zatim mu rekoh: \" O Allahov Poslaniče, šta ako ja ne mognem ni neki posao obaviti?\" On mi reče: \"Čuvaj se da nekome zlo ne učiniš, pa će ti se i to računati kao sadaka od tebe.\" - (Muttefekun alejhi)"
    },
    {
        "hadis": "Ibn-Mes'ud, r.a., prenosi da je Allahov Poslanik, a.s., rekao: \"Ne pripada nama onaj ko se udara po obrazima, dere odjeću i nariče kao u džahilijetu!\" (Muttefekun alejhi)"
    },
    {
        "hadis": "Ebu-Hurejre, r.a., prenosi da je Allahov Poslanik, a.s., rekao: \"Ne namećite se lažno u kupoprodaji, da biste tako podigli cijenu.\" (Muttefekun alejhi)"
    },
    {
        "hadis": "Mugire b. Šu'be r.a., pripovijeda da je Allahov Poslanik, sallallahu ‘alejhi ve selleme, rekao: \"Allah, dž.š., zabranio vam je neposlušnost vašim majkama, 'ne dam, a daj' (ne da ono što mu je dužnost, a uzima ono što mu nije dozvoljeno) i zakopavanje žive ženske djece, a pokudio 'rekla-kazala' (da ispriča sve što je čuo-la, ne vodeći računa je li to tačno, pa čak ako i sumnja da bi to moglo biti neistinito, a čovjeku je, po jednom hadisu, dosta laži da ispriča sve što je čuo), prekomjerno zapitkivanje i nekontrolirano trošenje imovine.\" - (Muttefekun alejhi)"
    },
    {
        "hadis": "Abdullah ibn'Amr ibn'As, r.a., prenosi da je Allahov Poslanik, sallallahu ‘alejhi ve selleme, rekao: \"Ovaj svijet je samo (prolazan) užitak, a najbolje u njemu je dobra (čedna i odgojena) žena.\" - (Muslim)"
    },
    {
        "hadis": "Ebu-Hurejre, r.a., prenosi da je Vjerovjesnik, sallallahu 'alejhi ve selleme, rekao: \"Kad god neko ode u džamiju - jutrom ili navečer, Allah mu pripremi mjesto u Džennetu, koliko god puta ode ujutro i navečer.\" (Muttefekun alejhi)"
    },
    {
        "hadis": "Suhejb bin Sinan r.a., pripovijeda da je čuo da je Allahov Poslanik, sallallahu alejhi ve selleme, rekao: \"Čudan li je primjer vjernika! U svakoj situaciji on dobija, a takvo stanje nije ni s kim drugim nego samo sa vjernikom; ako ga zadesi kakva radost, on zahvaljuje Allahu, dž.š., što mu donosi korist, a ako ga, pogodi kakvo zlo i šteta, on se strpi, i postojano se drži, pa mu i to donosi nagradu od Allaha, dž.š.\" - (Muslim)"
    },
    {
        "hadis": "Ebu-Se'id el-Hudri, r.a., prenosi da je Allahov Poslanik, sallallahu ‘alejhi ve selleme, rekao: \"Zaista je ovaj svijet sladak i privlačan, i zaista vas je Allah postavio namjesnicima na njemu, samo da bi vidio kako ćete postupati. Zato se bojte dunjaluka i bojte se žena, jer je prvi nered (fitneluk) među lzraelićanima bio zbog žene.\" - (Muslim)"
    },
    {
        "hadis": "Usame, r.a., prenosi da je Allahov Poslanik, sallallahu ‘alejhi ve selleme, rekao: \"Stao sam na vrata Dženneta te primijetih da su većina onih koji su u njega već bili ušli, siromasi, a bogataši još napolju čekaju da im se dozvoli ulazak, izuzev što su džehenemlije od njih već odvedene u Džehennem. Stao sam i na vrata Džehennema, i primijetih da su u njemu većinom žene.\" - (Muttefekun alejhi)"
    },
    {
        "hadis": "Imran ibn Husejn prenosi od Vjerovjesnika, s.a.v.s., da je rekao: \"Najbolji među vama su moji ashabi, zatim oni koji će doći poslije njih, zatim oni koji će doći poslije njih.\" Imran rekao je: \"Ne znam je li to Vjerovjesnik rekao dva ili tri puta.\" \"Zatim će doći narod koji će svjedočiti, a da nije pozvan da svjedoči, koji će varati i neće biti povjerljiv, koji će se zavjetovati, a neće zavjet iskupljivati, i u kojem će se pojaviti gojaznost.\" (Muttefekun alejhi)"
    },
    {
        "hadis": "Ebu-Hurejre, r.a., prenosi da je Allahov Poslanik, sallallahu ‘alejhi ve selleme, rekao: ‘Tako mi Allaha, nije vjernik, tako mi Allaha, nije vjemik, tako mi Allaha, nije vjernik!\" Neko reče: \"Ko to, Allahov Poslaniče?\" Alejhisselam odgovort: \"Onaj čiji susjed nije siguran od njegova zla i neprijatnosti od njega!\" - (Muttefekun alejhi)"
    },
    {
        "hadis": "Kajs b. Ebi-Hazim pripovijeda: \"Kada je Ebu-Bekr, r.a., posjetio jednu ženu, po imenu Zejneba, iz plemena Ahmes, primijetio je da ne govori. On zapita prisutne: 'Šta joj je? Zašto ne govori?' 'Zavjetovala se da će obaviti hadž šuteći!', rekoše mu. 'Govori!', naredio joj je. 'To nije dozvoljeno, jer je naslijeđe iz džahilijeta!' I žena progovori.\" (Buhari)"
    },
    {
        "hadis": "Ebu-Hurejre, r.a., prenosi da je Allahov Poslanik, a.s., rekao: \"Čuvajte se dviju kletvi!\" \"A kome su namijenjene te dvije kletve?\", upitaše. \"Onom ko vrši (veliku) nuždu po putevima i u hladovima!\" (Muslim)"
    },
    {
        "hadis": "Od Abdullaha bin Busre, r.a., prenosi se da je neki čovjek rekao: \"O Allahov Poslaniče, zaista mi je puno propisa islama, pa mi kaži nešto što ću uvijek (moći) izvršavati.\" On mu je rekao: \"Neka ti je jezik stalno vlažan od zikra (spominjanja) Allaha.\" (Tirmizi, hasen)"
    },
    {
        "hadis": "Ebu-Hurejre, r.a., prenosi da je Allahov Poslanik, sallallahu ‘alejhi ve selleme, rekao: \"Primite moju oporuku da ženama činite dobro! Zaista je žena stvorena od rebra, a najveća krivina rebra je baš njegov najviši dio; pa ako ga pokušaš ispraviti, slomit ćeš ga, a ako ga ostaviš, osta krivo. Zato jedni drugima preporučujte da ženama dobro čine!\" - (Muttefekun alejhi) A u drugom rivajetu, stoji: \"Žena je kao rebro, ako ga htjedneš ispraviti, slomit ćeš ga, a ako se koristiš njime, ono će ti koristiti, iako je krivo.\""
    },
    {
        "hadis": "Harise ibn Vehb, r.a., prenosi od Allahovog Poslanika, sallallahu ‘alejhi ve selleme, da je rekao: \"Hoćete li da vas obavijestim o tome ko su stanovnici Dženneta? Dženetlija je svaki nemoćni, slabi i skrušeni musliman. Kada bi on Allaha za nešto zakleo, Allah bi mu zasigurno to udovoljio. Hoćete li da vas obavijestim o stanovnicima Džehennema? To je svaki zadrti, sebični i oholi čovjek.\" - (Muttefekun alejhi)"
    },
    {
        "hadis": "Urveb 'Amir, r.a., priča da je neko pred Allahovim Poslanikom, a.s., spomenuo zle predznake, na što je on rekao: \"Od svega su najbolji dobri predznaci, ali nikakvi loši predznaci ne mogu spriječiti muslimana. Ako ugledate nešto neugodno, proučite: 'Gospodaru moj,samo Ti daješ dobro, samo Ti zaštićuješ od zla, i samo Tebi pripadaju vlast i moć.\"\" (Ebu-Davud sa sahih senedom)"
    },
    {
        "hadis": "Ebu-Se'id i Ebu-Hurejre, r.a., prenose da je Allahov Poslanik, a.s., rekao: \"Kada stanovnici Dženneta uđu u Džennet, povikat će melek: 'Vječno živite, nikada nećete umrijeti; vječno budite zdravi, nikada se nećete razboljeti; vječno budite mladi, nikada nećete ostariti; i vječno se naslađujte, nikada nećete biti nesretni!'\" (Muslim)"
    },
    {
        "hadis": "Ebu-Hurejre, r.a., pripovijeda da je jedna crnkinja mela (čistila) džamiju, ili je to bio jedan mladić, pa je preselila na ahiret, a Allahov Poslanik, sallallahu ‘alejhi ve selleme, pošto je dugo nije vidio, upitao za nju, na što mu ashabi odgovoriše da je umrla. Alejhisselam tada reče: \"Zašto me niste obavijestili o njenoj smrti?\" Oni kao da joj nisu pridavali neku važnost, a Alejhisselam reče: \"Pokažite mi njen kabur!\" Ashabi mu pokazaše njen kabur, a on, nakon što joj je klanjao dženazu, reče: \"Zaista su ovi kaburi mračni svojim stanarima, ali, uistinu, ih Allah njima osvijetli mojim namazom.\" - (Muttefekun alejhi)"
    },
    {
        "hadis": "Ebu-Hurejre, r.a., prenosi ove riječi Allahova Poslanika, sallallahu 'alejhi ve selleme: \"Kada bi ljudi znali vrijednost ezana i prvog safa, a zatim morali kockom određivati ko će ezaniti, ili u prvi saf stati, oni bi to činili; kada bi znali vrijednost ranjenja na namaz, oni bi se u tome natjecali, a kada bi znali vrijednost jacije i sabah - namaza, oni bi na njih dolazili, pa makar pužući!\" (Muttefekun alejhi)"
    },
    {
        "hadis": "Ebu-Se'id el-Hudri, r.a., pripovijeda: \"Allahov Poslanik, sallallahu 'alejhi ve selleme, tražio je utočište (kod Allaha) od džina i insanskog pogleda (uroka), sve dok mu nisu objavljene 'Mu'avvizetani': sure El-Felek i sura En-Nas, a kada su mu one objavljene, učio je njih, ostavivši sve ostalo.\" (Tirmizi, hasen)"
    },
    {
        "hadis": "Od Ebu-Musaa, r.a., prenosi se da je rekao: \"Vjerovjesnik, s.a.v.s., rekao je:'Primjer upute i znanja, s kojim me je Allah poslao, jeste kao primjer (obilne) kiše koja padne na zemlju (različite kvalitete). Dobra (plodna) vrsta zemlje primi vodu, te iz nje izraste bujna trava i bilje. Neplodna zemlja primi i zadrži vodu, pa Allah od nje da korist ljudima, te je oni piju, poje (stoku) i (zalijevaju) biljke. (Treća vrsta) jesu doline i ponori koji, niti vodu zadržavaju, niti na njima trava raste. To je primjer onoga koji je podučen i upućen u spoznaju vjere Allahove i koji se okoristio onim s čim me je Allah poslao, pa ga je spoznao i (druge) podučavao, kao i primer onoga koji zbog toga nije ni glavu podigao i nije prihvatio Allahovu uputu s kojom sam poslat.'\" (Muttefekun alejhi)"
    },
    {
        "hadis": "Ibn-Omer, r.a., prenosi da je Allahov Poslanik, a.s., rekao: \"Ne ostavljajte u kućama upaljenu vatru kada spavate.\" (Muttefekun alejhi)"
    },
    {
        "hadis": "Ebu-Hurejre, r.a., prenosi da je Allahov Poslanik, a.s., rekao: \"Ljudi su kao metali; najbolji u islamu su oni koji su bili najbolji u doba džahilijeta - ako shvate vjeru. Najbolji ljudi za upravljanje jesu oni koji to najviše izbjegavaju, a najgori su ljudi licemjeri, koji jednima govore jedno, a drugima drugo.\" (Muttefekun alejhi)"
    },
    {
        "hadis": "Havla bint Hakim, r.a., veli da je čula Resulullaha, sallallahu 'alejhi ve selleme, kad kaže: \"Ko stigne u neko mjesto, pa rekne: 'Utječem se Allahovim savršenim riječima od zla onoga što je stvorio\", neće mu ništa naškoditi sve dok ne ode iz tog mjesta.\" (Muslim)"
    },
    {
        "hadis": "Ebu Se'id el-Hudri, r.a., kaže da je Resulullah, sallallahu 'alejhi ve selleme, rekao: \"Podstičite one koji su na umoru da izgovore: \"La ilahe illallah\" - nema drugog boga, osim Allaha.\" (Muslim)"
    },
    {
        "hadis": "Ibn-Omer, r.a., prenosi da je Allahov Poslanik, a.s., rekao: \"Ne jedite i ne pijte lijevom rukom, jer šejtan jede i pije lijevom rukom.\" (Muslim)"
    },
    {
        "hadis": "Ibn-Omer, r.a., prenosi da je Allahov Poslanik, sallallahu 'alejhi ve selleme, rekao: \"Namaz obavljen u džema'atu vredniji je i bolji od namaza pojedinca za dvadeset sedam deredža.\" (Muttefekun alejhi)"
    },
    {
        "hadis": "Prenosi se da je Ebu-Mes'ud 'Ukbe b. 'Amir el-Bedri el-Ensari, r.a., rekao: \"Allahov Poslanik, sallallahu 'alejhi ve selleme, rekao je: 'Neka imam u džema'atu bude onaj koji najviše Kur'ana zna napamet, a ako u Kur'anu budu jednaki, onda najučeniji u hadisu, a ako budu i u hadisu isti, onda onaj koji je prije hidžru učinio, a ako i u hidžri budu isti, onda onaj koji je stariji po godinama. Neka nipošto čovjek ne staje pred džema'at u nečijoj kući, ili sjedne na posebno (određeno) mjesto, izuzev nakon dozvole domaćina..\"' U drugom rivajetu stoji: \"Onda onaj koji je prije primio islam\", umjesto: \"stariji po godinama\". - (Muslim)"
    },
    {
        "hadis": "Od Džabira, r.a., prenosi se da je rekao: \"Allahov Poslanik, s.a.v.s., rekao je: 'Kada neko do vas obavi namaz u džamiji, neka i u svojoj kući učini dio od svoga namaza, jer zaista će Allah od njegova namaza, u njegovoj kući, učiniti veliko dobro.'\" (Muslim)"
    },
    {
        "hadis": "Ebu-Mersed Kennaz b. Husajn, r.a., prenosi da je čuo Allahovog Poslanika, a.s., kada je rekao: \"Ne klanjajte prema kaburima i ne sjedajte na njih!\" (Muslim)"
    },
    {
        "hadis": "Prenosi se da je Abdullah b. 'Amr b. 'As, r.a., rekao: \"Jedan je čovjek prišao Allahovom Poslaniku, sallallahu ‘alejhi ve selleme, i rekao: ‘Zavjetujem ti se za hidžru i džihad, nadajući se nagradi od Allaha, džellešanuhu.' Alejhisselam mu reče: ‘Je li ti jedno od roditelja živo?' 'Jesu, oboje', odgovori on. Alejhisselam mu tada reče: 'Da li ti uistinu želiš nagradu od Allaha, dž.š.?' 'Da', odgovori on.'Onda se vrati svojim roditeljima i pazi na njih i lijepo se ponašaj prema njima', reče Alejhisselam.\"' -(Muttefekun alejhi)"
    },
    {
        "hadis": "Džabir b. Abdulah, r.a., prenosi da je Allahov Poslanik, a.s., rekao: \"Najdraži i najbliži meni na Sudnjem danu će biti ljudi najljepšeg morala, a najmrži i najudaljeniji od mene na Sudnjem danu će biti brbljivci, hvalisavci i oni koji usiljeno govore.\" (Tirmizi, hasen)"
    },
    {
        "hadis": "Ibn-Mes'ud, r.a., prenosi: \"Allahov Poslanik, a.s., prokleo je onoga ko kamatu uzima i onoga ko je daje!\" U Tirmizijevom predanju se još dodaje: \"I svjedoke i onoga ko je zapisuje.\" (Muslim)"
    },
    {
        "hadis": "Džabir, r.a., prenosi: \"Allahov Poslanik, s.a.v.s., podučavao nas je da obavljamo istiharu namaz u svakoj prilici, kao što nas je podučavao nekoj suri iz Kur'ana. Govorio je: 'Kada neko od vas hoće uraditi (neki posao), neka mimo farza klanja dva rekata, a zatim neka kaže: - Allahu moj, ja tražim za sebe što je dobro, s Tvojim znanjem, i molim Te da mi daš Svojom moći i molim Te da mi daš od Tvoje velike blagodati! Ti, zaista, sve možeš, a ja ne mogu! Ti sve znaš, a ja ne znam i Ti si poznavalac tajni! Allahu moj, ako je ovaj posao koristan za mene, moju vjeru, život, i svršetak (ahiret)\", ili je rekao: 'U mojoj bliskoj i dalekoj budućnosti, Ti mi ga odredi (propiši) i olakšaj, a zatim mi daj berićet (blagodat) u njemu. A ako je ovaj posao zlo za mene, moju vjeru, život, i svršetak (ahiret)\", u mojoj bliskoj i dalekoj budućnosti, Ti ga od mene otkloni i udalji me od njega i odredi (propiši) mi dobro i hajr, ma gdje se ono nalazilo, zatim mi daj da s njim budem zadovoljan!\" Rekao je: 'A zatim spomene svoju želju.'\" (Buhari)"
    },
    {
        "hadis": "Ebu-Hurejre, r.a., veli: \"Allahov je Poslanik, upitan o onome šta najviše uvodi ljude u Džennet, pa odgovori: ‘Bogobojaznost i lijep moral (ponašanje).' Potom je upitan što najviše uvodi ljude u Džehennem, pa je rekao: 'Usta i polni organ.\"' - (Tirmizi, hasen, sahih)"
    },
    {
        "hadis": "Ebu-Hurejre, r.a., prenosi od Allahovog Poslanika, a.s.: \"Neki čovjek je krenuo da posjeti brata muslimana u drugom selu, i Allah naredi meleku da ga sačeka na putu. 'Kuda ideš?', upita ga melek. 'Idem da posjetim brata u ovom selu', reče čovjek. 'Da ne ideš zato da ti uzvrati na dobročinstvo koji si mu učinio?' 'Ne. Hoću da ga posjetim, zato što ga volim, u ime Allaha.' 'Ja sam izaslanik Allaha' - reče mu melek -'da ti kažem da te je Allah zavolio, kao što si ti njega zavolio, u ime Allaha!\"' - (Muslim)"
    },
    {
        "hadis": "Ebu-Hurejre, r.a., prenosi da je Allahov Poslanik, a.s., rekao: \"Neka niko od vas ne želi sebi smrt, jer ako je bio dobročinitelj, možda će još više dobra uraditi, a ako je bio grješnik, možda će se pokajati, pa zatražiti Allahovo zadovoljstvo.\" - (Muttefekun alejhi)"
    },
    {
        "hadis": "Ibn-Omer, r.a., prenosi da je Allahov Poslanik, a.s., rekao: \"Jedna žena je bačena u Džehennem zbog mačke. Zatvorila ju je sve dok nije krepala. Niti ju je hranila, niti pojila, niti pustila da traži insekte po zemlji.\" (Muttefekun alejhi)"
    },
    {
        "hadis": "Ebu-Hurejre, r.a., prenosi da je Allahov Poslanik, a.s., rekao: \"Čovjek je vjere svoga prijatelja; zato pazite sa kim se družite!\" (Ebu- Davud, Tirmizi, hasen)"
    },
    {
        "hadis": "Ebu-Musa el-Eš'ari, r.a., pripovijeda da je Allahov Poslanik, sallallahu alejhi ve selleme, rekao: \"Zaista, Allah, dž. š., drži Svoju ruku ispruženom tokom cijele noći, primajući pokajanja onih koji su danju griješili, a danju pruža ruku, primajući pokajanja onih koji su noću griješili, sve dok sunce ne izađe sa zapada (kao jedan od predznaka kraja ovoga svijeta).\" (Muslim)"
    },
    {
        "hadis": "Sehl b. S'ad, r.a., prenosi da je Allahov Poslanik, a.s., rekao: \"Ko mi garantira čistotu jezika i spolnog mjesta, ja mu garantiram Džennet.\" (Muttefekun alejhi)"
    },
    {
        "hadis": "Ibn-Omer, r.a., jednom prilikom naišao je pored mladića Kurejšija, koji su živu pticu postavili za metu, gađali je strijelama i davali vlasniku ptice svaku strijelu koja promaši. Kad su ugledali Ibn-Omera, mladići se razbježaše, a on povika za njima: \"Ko je ovo uradio? Allah prokleo onoga ko je ovo uradio, jer Allahov Poslanik, a.s., prokleo je onoga ko nešto živo postavi za metu!\" (Muttefekun alejhi)"
    },
    {
        "hadis": "Džabir, r.a., kazuje: \"Allahov Poslanik, a.s., zabranio je ukrašavanje kabura, sjedenje i zidanje na kaburima.\" (Muslim)"
    },
    {
        "hadis": "Od Ebu-Amr Džerir b. Abdullaha prenosi se da je rekao: \"U sred bijela dana bili smo kod Allahovog Poslanika, s.a.v.s., pa mu dođe jedna grupa ljudi golih i ogrnutih vunenim ogrtačima ili sa abama od prugastog vunenog platna i sa obješenim sabljama; bili su većinom, odnosno svi iz plemena Mudar. Lice Allahovog Poslanika, s.a.v.s., izmijeni se kada vidje njihovu neimaštinu, on zatim uđe, pa izađe, pa onda naredi Bilalu da prouči ezan. Zatim klanja, pa ustade da održi govor-hutbu i reče: ‘O ljudi, bojte se vašeg Gospodara koji vas je stvorio od jednog čovjeka i od njega je stvorio bračnog mu druga i od njih dvoje mnoge muškarce i žene razmnožio. Bojte se Allaha sa čijim imenom jedni druge zaklinjete i rodbinske veze ne kidajte, jer Allah vas, zaista, osmatra i stalno nad vama bdi.\"' (Nisa, 1) A zatim je proučio ajet iz sure Hašr-18: ‘O vjernici, bojte se Allaha, nek svaka osoba osmotri šta je spremila za sutra. Neka dijeli čovjek od svojih dinara (zlatnika) i dirhema (srebrenjaka), od svoje odjeće, od saa (mjere) pšenice, od jednog saa svojih hurmi', pa reče: 'makar i polovinu hurme.' Dođe jedan čovjek od ensarija sa zavežljajem toliko teškim da su mu ruke iznemogle. Ljudi su dolazili i donosili darove, tako da sam vidio dvije hrpe hrane i odjeće. Lice Allahova Poslanika, s.a.v.s., zbog toga je tako zasjalo kao da je pozlaćeno. Poslanik, s.a.v.s., reče: 'Ko uvede jedan lijep običaj u islam, imat će za to nagradu, a i nagradu za sve one koji poslije njega to budu radili, a da se ne umanji njihova nagrada. A ko uvede u islam jedan ružan običaj, bit će mu teret i teret svih onih koji ga čine poslije njega, bez umanjenja njihovog tereta.'\" - (Muslim)"
    },
    {
        "hadis": "Od Džabira, r.a., prenosi se da je Allahov Poslanik, s.a.v.s., rekao: \"Primjer mene i vas je kao primjer čovjeka koji je zapalio vatru pa leptiri i skakavci ulijecu u nju, a on ih tjera od nje. Ja isto tako vas odbijam od vatre, držeći vas za vaše ogrtače, ali se vi izmićete iz mojih ruku.\" - (Muslim)"
    },
    {
        "hadis": "Ebu-Hurejre, r.a., prenosi da je Allahov Poslanik, sallallahu 'alejhi ve selleme, rekao: \"Čovjekov namaz u džema'atu vredniji je od njegovog namaza u privatnoj kući, ili dućanu u kojem radi, za dvadeset i nekoliko stupnjeva. To je zbog toga što, kada čovjek lijepo uzme abdest i krene u džamiju, sa isključivom namjerom da klanja namaz u džematu, svakim njegovim korakom povećava mu se po jedan stepen i briše po jedna pogreška, sve dok ne uđe u džamiju, a od momenta kada u nju uđe, on je u namazu sve dok je u džamiji zbog namaza. Svakog od vas meleki blagosiljaju dok god se nalazi na mjestu na kome je klanjao, govoreći: 'Smiluj mu se, Allahu, oprosti mu i primi njegovo kajanje!' Meleki to čine sve dok čovjek na tom mjestu nekog ne uznemiri ili izgubi abdest i time uznemiri meleke.\" (Muttefekun alejhi)"
    },
    {
        "hadis": "Ebu-Zerr, r.a., prenosi da je Allahov Poslanik, sallallahu ‘alejhi ve selleme, rekao: O Ebu-Zerr, kada budeš kuhao čorbu, dospi malo više vode pa pošalji svojim susjedima!\" – (Muslim)"
    },
    {
        "hadis": "Ebu-Hurejre, r.a., prenosi da je od Resulullaha, sallallahu 'alejhi ve selleme, čuo ove riječi: \"Šta mislite, kada bi pred vratima jednog od vas bila rijeka, u kojoj bi se on pet puta dnevno kupao, bi li imalo prljavštine na njemu ostalo?\" \"Ne bi\", odgovoriše prisutni, a Resulullah, a.s., dodade: \"To je primjer pet dnevnih namaza, s kojima Allah briše počinjene grijehe.\" (Muttefekun alejhi)"
    },
    {
        "hadis": "Ibn-'Abbas, r.a., prenosi da je Allahov Poslanik, sallallahu ‘alejhi ve selleme, rekao: \"Dvije blagodati (Allahove) neiskorištene su od većine ljudi: zdravlje i slobodno vrijeme.\" -  (Buhari)"
    },
    {
        "hadis": "Ibn-Mes'ud, r.a., prenosi da je Allahov Poslanik, sallallahu ‘alejhi ve selleme, rekao \"Iskrenost vodi dobroti, a dobrota vodi u Džennet. Zaista, čovjek iskreno govori (i radi) sve dok kod Allaha konačno ne bude upisan \"siddikom\" (potpuno iskrenim vjernikom). A laž zaista vodi u pokvarenost, a pokvarenost i griješenje vode u Džehennem. Čovjek koj stalno laže, kod Allaha bude upisan teškim lažljivcem.\" - (Muttefekun alejhi)"
    },
    {
        "hadis": "Ebu-Hurejre, r.a., prenosi da je Vjerovjesnik, sallallahu 'alejhi ve selleme, rekao: \"Allah voli kihanje, a ne voli zijevanje, pa kada neko od vas kihne i zahvali se Uzvišenom Allahu (riječima: \"Elhamdu lillahi\"), dužan je svaki musliman koji ga čuje da mu nazdravi (riječima: \"Jer hamukellah\", \"Allah ti se smilovao!\"). Što se, pak, zijevanja tiče ono je od šejtana, pa kada se nekom od vas bude zijevalo, neka se suzdrži koliko god može, jer, kada neko do vas zijeva, šejtan mu se smije.\" (Buhari)"
    },
    {
        "hadis": "Ebu-Hurejre, r.a., prenosi da je Allahov Poslanik, a.s., rekao: \"Uzvišeni Allah poručuje: 'Ja ću na Sudnjem danu biti protivnik trojici ljudi: čovjeku koji zada riječ, zaklinjući se u Moje ime, pa prevari; onome ko slobodnog čovjeka proda kao roba, pa potroši te pare; i čovjeku koji ne dadne platu iznajmljenom radniku koji mu završi ugovoreni posao.'\" (Buhari)"
    },
    {
        "hadis": "Od Ebu-Hurejrea, r.a., prenosi se da je rekao: \"Allahov Poslanik, s.a.v.s., rekao je: 'Kada neko od vas posti, neka bestidno (sramotno) ne govori, a ako ga neko bude psovao, ili ga napadne, neka kaže: - Ja postim!'\" (Muttefekun alejhi)"
    },
    {
        "hadis": "Aiša, r.a., prenosi da je neki čovjek rekao Vjerovjesniku, sallallahu 'alejhi ve selleme: \"Moja je majka dušu ispustila iznenada, a da je išta progovorila, smatram da bi sadaku učinila, pa hoće li ona imati nagradu ako ja sadaku za nju podijelim?\" 'Hoće', odgovori Vjerovjesnik, sallallahu 'alejhi ve selleme. (Muttefekun alejhi)"
    },
    {
        "hadis": "Ebu-Halid Hakib b. Hizam, prenosi da je Allahov Poslanik, s.a.v.s., rekao: \"Kupac i prodavač imaju slobodu izbora dok se ne rastanu, pa ako budu iskreni i suparnika informiraju o stvarnom stanju (robe), bit će im bereket u pazaru, a ako zataje i slažu, onda će im nestati bereket, u onome što su pazarili.\" (Muttefekun alejhi)"
    },
    {
        "hadis": "Enes, r.a., prenosi da je Allahov Poslanik, sallallahu 'alejhi ve selleme, rekao: \"Ko želi da mu se nafaka uveća i da mu se život produži, neka pazi i redovno posjećuje svoju rodbinu.\" - (Muttefekun alejhi)"
    },
    {
        "hadis": "Ebu-Hurejre, r.a., prenosi da je Allahov Poslanik, a.s., rekao: \"Uzvišeni Allah kaže: 'Pripremio sam Mojim dobrim robovima ono što oči nisu vidjele, za što uši nisu čule, i što nikad nikome nije na um palo!' Proučite, ako hoćete, ajet: 'I niko ne zna kakve ih skrivene radosti čekaju kao nagrada za njihova djela.'\" (Es-Sedžda, 17) (Muttefekun alejhi)"
    },
    {
        "hadis": "Ebu-Hurejre, r.a., prenosi da je Allahov Poslanik, a.s., rekao: \"Klonite se sedam velikih grijeha!\" \"A koji su to grijesi?\", upitaše ga, a on reče: \"Pripisivanje druga Allahu, sihr, bespravno ubijanje onoga koga je Allah zabranio ubiti, uzimanje kamata, otimanje imetka siročadi, bježanje s bojnog polja i potvaranje za blud čednih i bezazlenih vjernica.\" (Muttefekun alejhi)"
    },
    {
        "hadis": "Od Ibn-'Abbasa, r.a., prenosi se da je Allahov Poslanik, s.a.v.s., postio ašuru (deseti dan muharema) i naredio da se posti. (Muttefekun alejhi)"
    },
    {
        "hadis": "Od Aiše, r.a., prenosi se da je ona rekla: \"Vjerovjesnik, s.a.v.s, nije nijedan mjesec više postio od ša'bana, jer on je zaista postio cijeli ša'ban.\" U jednom drugom rivajetu stoji:\"... postio je cijeli ša'ban, osim malo.\" (Muttefekun alejhi)"
    },
    {
        "hadis": "Ebu-Musa el-Eš'ari, r.a., prenosi da je Allahov Poslanik, sallallahu 'alejhi ve selleme, rekao: \"Blagajnik (rizničar) musliman i pouzdan, koji izvršava što mu se naredi i u punoj mjeri isplaćuje onome kome mu je naređeno, dragovoljno (bez srdžbe), i sam je jedan od dobrotvora (davalaca sadake).\" - (Muttefekun alejhi) U drugom rivajetu stoji: \"Blagajnik, koji isplaćuje tačno onako kako mu se naredi...\""
    },
    {
        "hadis": "Od Ebu-Hurejrea, r.a., prenosi se da je Allahov Poslanik, s.a.v.s., rekao: \"Šehid ne osjeti (bol pri) pogibiji, osim kao što osjeti neko od vas kada se ubode.\" (Tirmizi, hasen, sahih)"
    },
    {
        "hadis": "Aiša, r.a., prenosi: \"Desna ruka Allahova Poslanika, s.a.v.s., bila je za abdest i jelo, a lijeva za hamama i ono što je prljavo.\" (Ebu-Davud, sahih sa senedom)"
    },
    {
        "hadis": "Od Ebu-Hurejrea, r.a., prenosi se da je Allahov Poslanik, s.a.v.s., rekao: \"Kada neko od vas zaspi, šejtan mu na potiljku zaveže tri čvora i pri vezivanju svakog kaže:'Moraš dugu noć prespavati!' Ukoliko se dotični probudi, pa spomene Uzvišenog Allaha, odriješi mu se jedan čvor; pa ako uzme abdest, odriješi se još jedan čvor; pa ako klanja, odriješi se i treći čvor, i on osvane čio i raspoložen. U protivnom, osvane lošeg raspoloženja, i lijen.\" (Muttefekun alejhi)"
    },
    {
        "hadis": "Ebu-Hurejre, r.a., prenosi da je Allahov Poslanik, sallallahu 'alejhi ve selleme, rekao: \"Ko poziva na pravi put (ko propagira uputu), ima nagradu za to kolika je nagrada onoga ko ga slijedi, bez smanjenja njihove nagrade, a isto tako, tko god poziva zabludi, krivom putu, griješan je isto onoliko koliko iznose grijesi onih koji ga slijede, a da to neće nimalo umanjiti njihove grijehe.\" - (Muslim)"
    },
    {
        "hadis": "Od Ebu-Hurejrea, r.a., prenosi se da je Allahov Poslanik, s.a.v.s., rekao: \"Ko kaže: 'La ilahe illallahu vahdehu la šerike lehu, lehulmulku ve lehulhamdu, ve huve 'ala kulli šej'in kadir' (Nema boga, osim Allaha, On nema sudruga, Njemu pripada sva vlast. Njemu pripada sva hvala i On je svemoćan) - svakoga dana sto puta, vrijedi mu kao da je oslobodio deset robova, biti će mu upisano sto dobrih djela, izbrisano sto grijeha, i biti će mu štit od šejtana toga dana sve do noći i niko nije nešto bolje uradio, osim čovjeka koji je uradio više od njega.\" I rekao je: \"Ko kaže u toku jednog dana sto puta: 'Subhanallahi ve bi hamdihi' (Slavljen je Allah i Njemu pripada sva hvala), oprošteni su mu grijesi, pa makar ih bilo kao morske pjene.\" (Muttefekun alejhi)"
    },
    {
        "hadis": "Abdullah b.'Amr b.'As, r.a., pripovijeda da je Allahov Poslanik, sallallahu ‘alejhi ve selleme, rekao: \"Veliki grijesi su: mnogoboštvo, neposlušnost roditeljima, ubistvo i lažna zakletva.\" - (Buhari)"
    },
    {
        "hadis": "Abdullah b. 'Amr b. 'As, r.a., prenosi da je Allahov Poslanik, a.s., rekao: \"Pri kome budu četiri svojstva, će biti čisti licemjer, a pri kome bude jedno od tih svojstava, pri njemu će biti svojstvo licemjerja, sve dok ga ne ostavi: iznevjeri kada mu se nešto povjeri, laže kada govori, prevari kada obeća i prelazi granicu kada se prepire.\" (Muttefekun alejhi)"
    },
    {
        "hadis": "Ibn-Mes'ud, r.a., prenosi da je Allahov Poslanik, sallallahu 'alejhi ve selleme, rekao: \"Nijedna osoba ne bude nepravedno ubijena, a da Ademovu prvom sinu (Kabilu) ne bude udio u njegovoj krvi, jer je on prvi počinio ubistvo.\" - (Muttefekun alejhi)"
    },
    {
        "hadis": "Od Sevbana, r.a., prenosi se da je rekao: \"Allahov Poslanik, s.a.v.s., bi, kada završi namaz, donosio istigfar tri puta, a zatim bi rekao: 'Allahume entesselamu veminkesselamu tebarekte ja zeldželali velikram' (Allahu moj, Ti si mir i spas, od Tebe je mir ispas, blagodarnost Tebi, o Vlasniče veličanstva i časti).\" Rečeno je El-Evzaiju, a on je jedan od prenosilaca ovoga hadisa: \"Kako se donosi istigfar?\" On je rekao: \"Izgovaraš: 'Estagfirullahe, estagfirullahe!' (od Allaha oprost tražim).\" (Muslim)"
    },
    {
        "hadis": "Ibn-Abbas prenosi da je Allahov Poslanik sallallahu 'alejhi ve selleme, rekao: \"Kada bi čovjek imao punu dolinu zlata, zaželio bi da ima dvije doline, a njegova usta neće ništa napuniti do prašina, a Allah prima pokanje od onoga ko se pokaje.\" - (Muttefekun alejhi)"
    },
    {
        "hadis": "Ebu-Hurejre, r.a., prenosi od Allahova Poslanika, sallallahu 'alejhi ve selleme: \"Ne činite vaše kuće grobovima (ne učeći i ne klanjajući u njima), jer šejtan zaista bježi od kuće u kojoj se uči sura El-Bekara.\""
    },
    {
        "hadis": "Ebu-Berze el-Eslemi, r.a., prenosi da je Allahov Poslanik, a.s., rekao: \"Niko se neće pomaknuti s mjesta obračuna, dok ga Allah ne upita za: život - u što ga je proveo, za znanje - je li po njemu radio, za imetak - odakle ga je zaradio i u što ga je potrošio, i za tijelo - u što ga je koristio.\" - (Tirmizi, Nesai-sahih)"
    },
    {
        "hadis": "Ebu-Hurejre, r.a., prenosi da je Allahov Poslanik, sallallahu ‘alejhi ve selleme, rekao: \"Nikakva opravdanja kod Allaha neće imati onaj kog je Allah, dž.š., poživio 60 godina.\" (Neće moći kazati: \"Da sam još koju godinu živio, ja bih radio bolje\", jer je život dug 60 godina dovoljan za svako pokajanje.) - (Buhari)"
    },
    {
        "hadis": "Ebu-Hurejre, r.a., prenosi da je Allahov Poslanik, a.s., rekao: \"Uzvišeni je Allah ljubomoran, a Njegova ljubomora iskazuje se onda kada čovjek čini ono što mu je Allah zabranio.\" (Muttfekun alejhi)"
    },
    {
        "hadis": "Od Enesa, r.a., prenosi se da je rekao: \"Allahov Poslanik, s.a.v.s., rekao je:'Ustajte na sehur, jer je u sehuru zaista berićet'\" (Muttefekun alejhi)"
    },
    {
        "hadis": "Ebu-Hurejre, r.a., prenosi da je Allahov Poslanik, s.a.v.s., rekao: \"Najbliži je rob svome Gospodaru kada obavlja sedždu, pa mnogo činite dovu.\" (Muslim)"
    },
    {
        "hadis": "Od 'Abdullaha bin 'Amra bin el-'Asa, r.a., prenosi se da je čuo Allahova Poslanika,s.a.v.s., kako kaže: \"Ko na mene donese jedan salavat, Allah na njega donese salavat deset puta.\" (Muslim)"
    },
    {
        "hadis": "Od Džabira, r.a., prenosi se da je rekao: \"Allahov Poslanik, s.a.v.s., rekao je: 'Ko se boji da neće ustati na kraju noći, neka klanja vitr na njenom početku, a ko želi da ustane na kraju noći, neka vitr klanja krajem noći, jer zaista je namaz krajem noći osvjedočen, tj. prisustvuju mu meleki, a to je bolje.'\" (Muslim)"
    },
    {
        "hadis": "Aiša, r.a., prenosi da je Allahov Poslanik, s.a.v.s., rekao: \"Dva rekata sabaha su bolja od dunjaluka i svega što je na njemu.\" (Muslim)"
    },
    {
        "hadis": "Enes, r.a., kaže da je Allahov Poslanik, sallallahu 'alejhi ve selleme, rekao: \"Primljena je dova koja se prouči između ezana i ikameta.\" (Ebu-Davud, Tirmizi, hasen) "
    },
    {
        "hadis": "Od Ebu-Abdullaha en-Numana b. Bešira, r.a., prenosi se da je rekao: \"Čuo sam Allahova Poslanika, s.a.v.s., da kaže: 'Zaista, ili ćete poravnati vaše safove ili će Allah vaša srca razjediniti.\"'- (Muttefekun alejhi)"
    },
    {
        "hadis": "Ebu-Hurejre, r.a., prenosi da je Allahov Poslanik, sallallahu 'alejhi ve selleme, rekao: \"Ko otkloni vjerniku jednu od njegovih dunjalučkih nevolja, Allah će otkloniti jednu od njegovih nedaća na Sudnjem danu. Ko olakša svome dužniku (time što će mu odgoditi rok, ili mu posve oprostiti), Allah će njemu olakšati i na dunjaluku i na ahiretu. Ko pokrije (nevaljalštine) jednog muslimana, Allah će njega pokriti na ovom i na budućem svijetu. Allah je u pomoći Svome robu, sve dok je on u pomoći svome bratu. Ko krene na put tražeći nauku, Allah će mu tim njegovim putem olakšati put u Džennet. Kad god se sakupe ljudi u kući Allahovoj (džamiji), radi učenja Kur'ana, i njegovog zajedničkog proučavanja, Allah na njih spusti smirenost i prekrije ih svojim rahmetom, meleki ih okruže i Allah ih spominje, ponoseći se njima, medu svojim najbližim (naj-odabranijim) stvorenjima. A onoga koji zakaže u svojim djelima, neće spasiti njegovo porijeklo.\" - (Muttefekun alejhi)"
    },
    {
        "hadis": "Od Ebu-Hurejrea, r.a., prenosi se da je Allahov Poslanik, s.a.v.s., rekao: \"Ko klanja uz ramazan (teravih namaz), vjerujući i nadajući se (nagradi), biti će mu oprošteni (mali) grijesi koje je počinio.\" (Muttefekun alejhi)"
    },
    {
        "hadis": "Abdullah b. 'Amr b. 'As, r.a., veli da je Allahov Poslanik, sallallahu 'alejhi ve selleme, rekao: \"Nije dovoljno samo uzvratiti posjetu svojoj rodbini. Pravilno se ponaša prema svojoj rodbini onaj koji, kada ga ona zaboravi, ili odbaci, obnavlja vezu sa njom.\" - (Buhari)"
    },
    {
        "hadis": "Ebu-Hurejre, r.a., prenosi ove riječi Allahova Poslanika, sallallahu 'alejhi ve selleme: \"Nad vama naizmjenično bdiju meleki dana i meleki noći, a sastaju se (smjenjuju se) na sabahskom i ikindijskom namazu. Zatim se oni koji su među vama noćili penju (na nebesa), pa ih Allah upita, a On najbolje zna: 'U kakvom ste stanju ostavili Moje robove?\", a meleki odgovore: 'Ostavili smo ih da klanjaju, a i zatekli smo ih da klanjaju.'\" (Muttefekun alejhi)"
    },
    {
        "hadis": "Od Ebu-Hurejrea, r.a., se prenosi da je Allahov Poslanik, s.a.v.s., rekao: \"Nema nijednog ranjenika koji je ranjen na Allahovom putu, a da neće doći na Sudnji dan s ranomk oja krvari; boja joj je boje krvi, a miris - miris mošusa.\" (Muttefekun alejhi)"
    },
    {
        "hadis": "Ebu-Hurejre, r.a., prenosi da je Allahov Poslanik, a.s., rekao: \"Sedam vrsta ljudi bit će u Allahovom hladu, na dan kad nikakvoga drugog hlada neće biti: praveden vladar; mladić koji odraste u pokornosti Allahu; čovjek čije je srce neprestano vezano za džamiju; prijatelji koji se vole samo u ime Allaha, takvi su kada se sastaju i raziđu; čovjek kojeg lijepa i ugledna žena pozove na blud, pa kaže: 'Ne, ja se bojim Allaha'; čovjek koji udjeljuje milostinju, tako da mu lijeva ruka ne zna šta je desna udijelila; i čovjek koji se sjeti Allaha u samoći, pa pusti suze.\" - (Muttefekun alejhi)"
    },
    {
        "hadis": "Ebu-Katade Haris ibn Rub'ijj, r.a., prenosi da je Allahov Poslanik, sallallahu 'alejhi ve selleme, rekao: \"Zaista, ja stupim u namaz i poželim da dugo ostanem u njemu, pa začujem plač djeteta i skratim namaz, kako ne bih otežao njegovoj majci.\" - (Buhari)"
    },
    {
        "hadis": "Ebu-Hurejre, r.a., pripovijeda da je Allahov Poslanik, sallallahu ‘alejhi ve selleme, poljubio Hasana, sina Alijinog r.a., a kod njega bio Akra' ibn Habis, pa rekao je (Akra'): \"Ja imam desetero djece, a još nikada nisam nijedno poljubio!\" Allahov Poslanik, sallallahu 'alejhi ve selleme, pogleda ga, pa reče: \"Ko nije milostiv, neće ni njemu biti ukazana milost.\" - (Muttefekun alejhi)"
    },
    {
        "hadis": "Aiša, r.a., prenosi da je čula kada je Allahov Poslanik, a.s., rekao: \"Ne obavljajte namaz kada se jelo postavi, i ne obavljajte namaz kada osjećate potrebu za obavljanjem nužde.\" (Muslim)"
    },
    {
        "hadis": "Ebu-Hurejre, r.a., prenosi da je Allahov Poslanik, sallallahu 'alejhi ve selleme,rekao: \"Tri dove su, bez sumnje, primljene (uslišane); dova mazluma - onoga kome je nepravda učinjena, dova musafira i roditeljsko proklinjanje svoga djeteta.\" (Ebu-Davud, Tirmizi, hasen)"
    },
    {
        "hadis": "Od Ebu-A'vera Seida bin Zejda bin 'Amra bin Nufejla, jednog od deseterice, kojima je posvjedočeno da će ući u Džennet, r.a., prenosi se da je rekao: \"Čuo sam Allahova Poslanika, s.a.v.s., kako kaže: 'Ko pogine braneći svoj imetak, šehid je, ko pogine braneći sebe, šehid je, ko pogine braneći svoju vjeru, šehid je, ko pogine braneći svoju obitelj, šehid je.'\" (Ebu-Davud, Tirmizi, hasen, sahih)"
    },
    {
        "hadis": "Ebu-Hurejre, r.a., prenosi da je Allahov Poslanik, a.s., rekao: \"Odugovlačenje imućne osobe s otplatom duga je nasilje. A ako dužnik prebaci dug na drugu imućnu osobu koja njemu duguje, neka to zajmodavac prihvati.\" (Muttefekun alejhi)"
    },
    {
        "hadis": "Ebu-Hurejre, r.a., prenosi da je Allahov Poslanik, a.s., rekao: \"Zaklinjanje pri prodaji prodaje robu, ali uništava bereket.\" (Muttefekun alejhi)"
    },
    {
        "hadis": "Ebu-Hurejre, r.a., prenosi da je Allahov Poslanik, a.s., rekao: \"Allah će vam primati dove, sve dok ne budete požurivali i govorili: 'Molio sam Gospodara, pa mi dovu nije primio!'\" U Muslimovom predanju kaže se: \"Dova se prima, sve dok čovjek ne bude molio grijehom, prekidanjem rodbinskih odnosa, i dok ne bude požurivao.' 'A šta je požurivanje, Allahov Poslaniče?', neko upita.' Požurivanje je da kaže: - Molio sam i molio, pa mi se dova nije primila - i tada se ražalosti i prestane učiti dovu.'\" (Muttefekun alejhi)"
    },
    {
        "hadis": "Ebu-Derda', r.a., prenosi da je Allahov Poslanik, a.s., rekao: \"Kada čovjek nekoga prokune, prokletstvo se uzdigne na nebesa i pred njim se zatvore nebeska vrata. Zatim se, kada se spušta na Zemlju, pred njim zatvore zemaljska vrata i prokletstvo krene desno i lijevo. Ako ne nađe izlaz, prokletstvo se spusti na onoga ko je proklet, ako je bio za toga, a ako nije, onda se vrati onome ko je proklinjao.\" (Ebu-Davud)"
    },
    {
        "hadis": "Ebu-Musa, r.a., prenosi da je Allahov Poslanik, sallallahu 'alejhi ve selleme, rekao: \"Allah, dž.š., odgađa kaznu nasilniku, ali kad mu kazna dođe, neće ga pomilovati.\"  Zatim je proučio: \"Eto, tako Gospodar tvoj kažnjava kad kažnjava sela i gradove koji su nasilje činili. Kažnjavanje Njegovo zaista je bolno i strašno.\" (Hud, 102) - (Muttefekun alejhi)"
    },
    {
        "hadis": "Ebu-Hurejre, r.a., prenosi da je Allahov Poslanik, s.a.v.s., rekao: \"Kada dođe ramazan, otvaraju se dženetska vrata, zatvaraju se džehenemska, a šejtani se vezuju (u lance).\" (Muttefekun alejhi)"
    },
    {
        "hadis": "Ebu-Hurejre, r.a., prenosi da je čuo Allahovog Poslanika, a.s., kada kaže: \"Postite petak samo onda kada postite dan prije ili poslije njega.\" (Muttefekun alejhi)"
    },
    {
        "hadis": "Huzejfe, r.a., prenosi da je Allahov Poslanik, a.s., rekao: \"Neće ući u Džennet onaj ko prenosi tuđe riječi.\" (Muttefekun alejhi)"
    },
    {
        "hadis": "Aiša, r.a., kazuje: \"Pred povratak Allahovog Poslanika, a.s., sa jednog putovanja, bila sam zastrla prozor zavjesom na kojoj su bile slike. Kada je to ugledao, lice Allahovog Poslanika, a.s., pocrvenje. 'Aiša! Allah će kazniti najtežom kaznom na Sudnjem danu one koji oponašaju Allahovo stvaranje!\", reče mi. Zastor smo pocijepali i od njega napravili jedan ili dva jastuka.\" (Muttefekun alejhi)"
    },
    {
        "hadis": "Sehl bin Sa'd, r.a., prenosi od Vjerovjesnika, s.a.v.s., da je on rekao: \"U Džennetu imaju vrata koja se zovu Rejjan. Na njih će ući postači na Sudnjem danu i više niko osim njih. Reći će se: 'Gdje su postači?\" Oni će ustati i na njih niko drugi neće ući, osim njih. Kada oni uđu, ona će se zatvoriti i niko više na njih neće ući.\" (Muttefekun alejhi)"
    },
    {
        "hadis": "Džabir, r.a., pripovijeda da je Resulullah, sallallahu 'alejhi ve selleme, rekao: \"Zaista je šejtan uvijek s vama, pa čak i kada jedete. Stoga, kada nekom od vas ispadne zalogaj, neka ga uzme, otkloni ono što se na njega nalijepilo, a zatim pojede, i neka ga ne ostavlja šejtanu. A kada jelo završi, neka prste obliže, jer ne zna u kojoj mu je hrani berićet.\" (Muslim)"
    },
    {
        "hadis": "Ebu-Se'id, r.a., prenosi da je Allahov Poslanik, a.s., rekao: \"Nije dozvoljeno muškarcu da gleda u stidni dio tijela drugog muškarca, niti je dozvoljeno ženi da gleda u stidni dio tijela druge žene; i nije dozvoljeno muškarcu da spava sa muškarcem, a ženi sa ženom, pod jednim pokrivačem. (Muslim)"
    },
    {
        "hadis": "Zejd bin Halid el-Džuheni, r.a., prenosi od Allahova Poslanika, s.a.v.s., da je rekao: \"Ko iftari postača, imat će nagradu kao i on, a postaču neće biti umanjeni njegovi sevabi.\" (Tirmizi, hasen, sahih)"
    },
    {
        "hadis": "Usame b. Zejd, r.a., prenosi da je Allahov Poslanik, s.a.v.s., rekao: \"Nisam ostavio iza sebe teže iskušenje po muškarca od iskušenja sa ženama.\" - (Muttefekun alejhi)"
    },
    {
        "hadis": "Ibn-'Abbas, r.a., prenosi da je Allahov Poslanik, a.s., rekao: \"Ko bude pričao lažne snove, zadužit će se da u čvor sveže dvije dlake, što neće moći učiniti; ko bude prisluškivao razgovor ljudi koji to ne žele, na Sudnjem danu u uši će mu se nasuti olovo; ko bude nacrtao sliku, će biti kažnjen i naredit će mu se da u nju udahne dušu, ali to neće moći učiniti.\" (Buhari)"
    },
    {
        "hadis": "Ebu-Hurejre, r.a., prenosi da je Allahov Poslanik, a.s., rekao: \"Ne pripada nama onaj ko zavadi čovjeka i ženu, ili slugu i gospodara.\" (Ebu-Davud, sahih)"
    },
    {
        "hadis": "Ibn'Umer, r.a., prenosi da je Vjerovjesnik, s.a.v.s., rekao: \"Dužnost je muslimanu da sluša i da je pokoran u onome što voli i ne voli, osim ukoliko mu bude naređeno nešto što je zabranjeno, a kada mu se naredi nešto što je zabranjeno, onda nema poslušnosti ni pokornosti.\" - (Muttefekun alejhi)"
    },
    {
        "hadis": "Ebu-Hurejre, r.a., prenosi da je Allahov Poslanik, sallallahu ‘alejhi ve selleme, rekao: \"Svakoga dana, u kome osvanu Allahovi robovi, siđu dva meleka, te jedan od njih rekne: ‘O Allahu, Ti nadoknadi onome ko dijeli!' A drugi veli: ‘O Allahu, Ti uništi imetak onoga koji sprečava njegovo trošenje u korisne svrhe (ne dijeli)!\"' - (Muttefekun alejhi)"
    },
    {
        "hadis": "Ebu-Hurejre, r.a., prenosi da je Allahov Poslanik, a.s., rekao: \"Tako mi Allaha, u Čijoj je ruci moja duša, nećete ući u Džennet sve dok ne budete vjerovali, a nećete vjerovati sve dok se ne budete voljeli! Hoćete li da vas uputim na djelo kojim ćete se, ako ga budete činili, zavoljeti? Nazivajte selam jedni drugima!\" (Muslim)"
    },
    {
        "hadis": "Sufjan ibn Abdullah, r.a., kaže da je rekao: \"O Allahov Poslaniče, reci mi nešto o islamu, da poslije tebe više nikog ne pitam.\" Alejhisselam reče: \"Reci: 'Ja vjerujem u Allaha', i na tome čvrsto ustraj.\" - (Muslim)"
    },
    {
        "hadis": "Ebu-Abdullah Selman El-Farisi, r.a., prenosi da je Allahov Poslanik, sallallahu 'alejhive selleme, rekao: \"Čovjek koji se u petak okupa i, prema mogućnostima, očisti, pa se naulji (namaže uljem) ili namiriše kućnim mirisom, a zatim izađe (u džamiju), ne rastavljajući dvojicu u safu,(tj. ne ezijeti prisutne džematlije svojim hodom između i preko njih, kako bi sebi našao mjesto- p. prev.), potom klanja propisani namaz i prati hutbu izlaganje imama, bit će mu oprošteni(manji) grijesi počinjeni između te i prethodne džume.\" (Buhari)"
    },
    {
        "hadis": "Džabir, r.a., prenosi da je Allahov Poslanik, sallallahu ‘alejhi ve selleme, rekao: \"Nijedan musliman ne zasadi nijednu sadnicu, a da sve što se sa nje pojede njemu ne bude sadaka; i ono što se sa nje ukrade je njemu sadaka, i ono što se od nje odlomi je njemu sadaka.\" - (Muslim) U drugom njegovom rivajetu stoji: \"Nijedan musliman ne zasadi sadnicu, sa koje pojede čovjek, ili životinja, ili ptica, a da to njemu ne bude sadaka, sve do Kijametskog dana.\" A u jednom rivajetu stoji: \"Nijedan musliman ne posadi sadnicu niti posije žitaricu, sa koje pojede čovjek, ili životinja, ili bilo šta, a da to njemu ne bude sadaka.\""
    },
    {
        "hadis": "Ebu-Hurejre, r.a., prenosi da je Allahov Poslanik, s.a.v.s., rekao: \"Ući će u Džennet ljudi čija su srca poput ptičjih srca\" - (Muslim). (Značenje: oslanjaju se na Allaha, a kaže se: \"srca su im nježna i mehka\".) - (Muslim)"
    },
    {
        "hadis": "Aiša, r.a., kazuje: \"Prilikom lijeganja u postelju, Allahov Poslanik, a.s., puhnuo bi u ruke, a zatim bi na njih proučio 'Kul huvallahu ehad, Kul e'uzu bi rabbi-l-felak i Kul e'uzu bi rabbinnas', i rukama potrao po tijelu.\" U drugom hadisu se kaže: \"Kada bi lijegao u postelju, Allahov Poslanik, a.s., sastavio bi ruke, a zatim puhnuo na njih, proučio: 'Kul hevallahu ehad', 'Kul e'uzu bi rabbilfelak' i 'Kule'uzu bi rabbinnas', a potom bi rukama potrao šta bi mogao od tijela, započinjući od glave i lica prednjeg dijela tijela. Radio je to po tri puta.\" (Muttefekun alejhi)"
    },
    {
        "hadis": "Aiša, r.a., veli: \"Kada bi nastupilo zadnjih deset dana ramazana, Allahov Poslanik, sallallahu ‘alejhi ve selleme, te bi noći provodio u ibadetu, čeljad bi svoju budio na namaz, neobično bi se trudio u ibadetu i okanio bi se bračnog odnosa (posvećujući se isključivo ibadetu).\" - (Muttefekun alejhi)"
    },
    {
        "hadis": "Ebu-Hurejre, r.a., prenosi da je Allahov Poslanik, sallallahu 'alejhi ve selleme, rekao: \"Od ljepote islama - vjere jednog čovjeka jeste da se kloni onoga što ga se ne tiče.\" (Tirmizi, hasen)"
    },
    {
        "hadis": "Aiša, r.a., prenosi daje Allahov Poslanik, sallallahu ‘alejhi ve selleme, rekao: \"Ko nešto novo uvede u vjeru (ovu našu stvar), što nije od nje, to se odbija.\" - (Muttefekun alejhi) U drugom, Muslimovom, rivajetu stoji: \"Ko uradi neki posao koji ne spada u našu vjeru, to se ne prihvata.\""
    },
    {
        "hadis": "Ebu-Hurejre, r.a., pripovijeda da je Allahov Poslanik, a.s., rekao: \"Čuvajte se sumnjičenja, jer je sumnjičenje najlažniji govor. Nemojte prisluškivati, nemojte špijunirati, ne budite egoisti, nemojte zavidjeti jedni drugima, nemojte se međusobno mrziti, nemojte jedni drugima okretati leđa, budite braća, o, Božiji robovi, kao što vam je On naredio. Musliman je muslimanu brat i on mu ne čini nepravdu; ne ponižava ga i ne prezire. Bogobojaznost je ovdje, bogobojaznost je ovdje - i pokaza na svoje grudi Dovoljno je čovjeku zla da prezire svog brata muslimana. Svakom muslimanu zabranjena je krv, čast i imetak drugog muslimana. Allah ne gleda u vaša tijela niti u vaše likove, nego gleda u vaša srca i vaša djela.\" (Muslim)"
    },
    {
        "hadis": "Od Ebu-Hurejrea, r.a., prenosi se da je Vjerovjesnik, s.a.v.s., rekao: \"Neka niko od vas ne posti prije ramazana jedan ili dva dana, osim ako čovjek posti svoj (uobičajeni) post, pa neka posti taj dan.\" (Muttefekun alejhi)"
    },
    {
        "hadis": "Ebu-Ma'bed Mikdad b. Esved, r.a., kazuje da je pitao Allahovog Poslanika, a.s.: \"Ako se sukobim s nevjernikom i on mi sabljom odsiječe ruku, a zatim pobjegne na drvo i kaže: 'Prihvatam islam', smijem li ga ubiti nakon što to kaže, Allahov Poslaniče?\" \"Ne smiješ! \" \"Ali, Allahov Poslaniče, on mi je odsjekao ruku, a zatim je to rekao pošto ju je odsjekao!?\" \"Ne smiješ ga ubiti, jer, ako ga tada ubiješ, on će biti u položaju u kom si ti bio prije nego što si ga ubio, a ti ćeš biti u položaju u kom je on bio prije nego što je to izgovorio.\" (Muttefekun alejhi)"
    },
    {
        "hadis": "Od Ebu-Hurejrea, r.a., se prenosi da je Allahov Poslanik, s.a.v.s., rekao: \"U Džennetu ima stotinu deredža, (stupnjeva), koje je Allah pripremio mudžahidima na Allahovom putu. Između dvije deredže je kao između neba i Zemlje.\" (Buhari)"
    },
    {
        "hadis": "Ijad b. Himar, r.a., prenosi da je Allahov Poslanik, s.a.v.s., rekao: \"Uzvišeni Allah mi je objavio da vi jedan drugom budete ponizni pa da niko nikoga ne ugnjetava i da se ni jedan ne hvališe nad drugim.\" (Muslim)"
    },
    {
        "hadis": "Ibn-'Abbas, r.a., prenosi da je Allahov Poslanik, a.s., rekao: \"Onaj ko poklon traži nazad, sličan je psu koji povrati, pa pojede ono što je povratio.\" (Muttefekun alejhi)"
    },
    {
        "hadis": "Omer b. Hattab, r.a., prenosi i kaže da je Allahov Poslanik, s.a.v.s., rekao: \"Ko zaspi i ne prouči svoje učenje koje praktikuje svaku večer ili samo jednog njegovog dijela, pa ga prouči između sabaha i podne-namaza, piše mu se kao da ga je proučio noću.\" - (Muslim)"
    },
    {
        "hadis": "Ebu-Hurejre, r.a., prenosi da je Allahov Poslanik, sallallahu 'alejhi ve selleme, rekao: \"Pet namaza, džuma do džume i ramazan do ramazana iskupnici su grijeha između njih, ako se izuzmu veliki grijesi.\" - (Muslim)"
    },
    {
        "hadis": "Tarik ibn Šihab el-Bedželi, r.a., pripovijeda da je jedan čovjek, koji je već bio stavio nogu u uzengije, upitao Allahovog Poslanika, sallallahu 'alejhi ve selleme: \"Koji je džihad najbolji?\" Alejhisselam mu reče: \"Istinita riječ u lice vladaru - nasilniku.\" (Nesai sahih) "
    },
    {
        "hadis": "Ibn'-Umer, r.a., prenosi daje Allahov Poslanik, sallallahu ‘alejhi ve selleme, rekao: \"Musliman je brat muslimanu; on ga ne ugnjetava i ne ostavlja ga na cjedilu (ne predaje ga drugom). Ko pomogne svome bratu u nevolji, Allah će njemu pomoći u njegovoj nevolji. Ko otkloni nedaću jednog muslimana, Allah će njemu otkloniti jednu od njegovih nedaća na Sudnjem danu. A ko prikrije (sramote) jednog muslimana, Allah će prikriti njegove na Sudnjem danu.\" - (Muttefekun alejhi)"
    },
    {
        "hadis": "Bera ibn Azib r.a., pripovijeda: \"Allahov Poslanik, sallallahu ‘alejhi ve selleme, naredio nam je sedmero, a zabranio sedmoro. Naredio nam je obilazak bolesnika, ispraćaj dženaza, islamsko nazdravljanje onome koji kihne, udovoljiti onome ko te zakune da mu nešto uradiš, pomaganje obespravljenog, odazivanje onome ko pozove i nazivanje selama. A zabranio nam je zlatno prstenje, pijenje iz srebrnih čaša, upotrebljavanje svilenih jastuka, nošenje svilenih košulja isprošivanih lanenim šarama i nošenje bilo kakve svilene odjeće.\" Po jednom rivajetu, medu prvih sedmero je i vraćanje izgubljenih životinja vlasniku. - (Muttefekun alejhi)"
    },
    {
        "hadis": "Ebu Se'id i Ebu Hurejre r.a., prenose da je Allahov Poslanik, sallallahu `alejhi ve selleme,  rekao: \"Muslimana (vjernika) ne pogodi nikakva nesreća ili bolest, niti tuga ili žalost, niti bilo kakva nezgoda, čak ni obični ubod trna, a da mu zbog toga Allah dž.š. ne oprosti dio njegovih grijeha.\" - (Muttefekun alejhi)"
    },
    {
        "hadis": "Od Džabira, r.a., se prenosi da je rekao: \"Allahov Poslanik, s.a.v.s., kada bi držao hutbu, oči bi mu pocrvenile, podigao bi svoj glas i pojačao bi srdžbu kao da upozorava na neprijatelja, pa bi rekao: 'Neprijatelj će vas iznenaditi ujutro ili uveče.' Zatim bi rekao: 'Ja sam poslat, a između mene i Sudnjeg dana je koliko između ova dva prsta!', uperio bi kažiprst i srednji prst, pa bi rekao: 'Nakon navedenog, znajte da je Allahova Knjiga najbolji govor, a najbolja uputa je uputa Muhammeda, s.a.v.s. Najgore stvari su novotarije, a svaka novotarija je zabluda.' Zatim je rekao: 'Ja sam preči svakom muminu od njega samoga sebi. Ko od vjernika ostavlja imetak, neka ga ostavi svojoj porodici, a ko umre, a ostane mu dug ili djeca, neka ih ostavi meni i i ja ću se za njih brinuti.\"' - (Muslim)"
    },
    {
        "hadis": "Ebu-Zerr, r.a., prenosi daje Allahov Poslanik, sallallahu 'alejhi ve selleme, rekao: \"Svaki dan čovjek osvane dužan podijeliti sadaku za svaki zglob i svaku kost svoga tijela: svaki tesbih (izgovor riječi subhanallah) jeste sadaka, svako izgovoreno \"elhamdulillah\" je sadaka, svako \"la ilahe illallah\" je sadaka, svaki tekbir je sadaka, naređivanje na dobro je sadaka i sprečavanje zla je sadaka. Sve to nadoknađuje klanjanje dva rek'ata duha namaza (nafila-namaz, koji se klanja nakon što sunce odskoči, pa do pred podne na izvjesno vrijeme).\" - (Muslim)"
    },
    {
        "hadis": "Aiša, r.a., prenosi daje Allahov Poslanik, sallallahu ‘alejhi ve selleme, rekao: “Ko učini nasilje koliko za jedan pedalj zemlje, sva zemlja tog pedlja kroz dubinu sedam zemalja bit će mu natovarena oko vrata (na Sudnjem danu).\" - (Muttefekun alejhi)"
    },
    {
        "hadis": "Enes, r.a., pripovijeda da je jednog dana Allahov Poslanik, sallallahu ‘alejhi ve selleme, ušao u džamiju i ugledao uže zategnuto između dva stupa, pa je upitao: \"Kakvo je ovo uže?\" Prisutni rekoše: \"Ovo je uže Zejnebe; kada klanja, pa se umori, pridrži se za njega.\" \"Sklonite ga, neka svako od vas klanja dok je odmoran, a kada se umori, neka ostavi namaz i legne da se odmori\", odgovori on. - (Muttefekun alejhi)"
    },
    {
        "hadis": "Amr ibn Šu'ajb prenosi od svoga oca, a ovaj od svoga djeda, r.a., da je Allahov Poslanik, sallallahu ‘alejhi ve selleme, rekao: \"Naređujte svojoj djeci klanjanje namaza kad im bude sedam godina, a silom ih nagonite na namaz kad napune deset godina, i u posteljama ih rastavljajte (muško i žensko).\""
    },
    {
        "hadis": "Od Ebu-Hurejrea, r.a., prenosi se da je rekao: \"Čuo sam Allahova Poslanika, s.a.v.s., kako kaže: 'Allah je učinio milost (rahmet) od sto dijelova; kod sebe je zadržao devedeset devet, a na Zemlju je spustio jedan dio. I od tog jednog dijela stvorenja su samilosna jedno prema drugom, tako da i životinja podigne nogu sa svoga mladunčeta, bojeći se da ga ne povrijedi.\"' - (Muttefekun alejhi) Isti hadis prenio je Muslim od Selmana el-Farisija, r.a., da je Allahov Poslanik, s.a.v.s.,rekao: \"Zaista, Uzvišeni Allah ima sto milosti; jednom od njih su međusobno milostiva stvorenja među sobom, a devedeset i devet je za Sudnji dan.\""
    },
    {
        "hadis": "Ebu Malik El-Haris El-Eš`ari, pripovijeda da je Allahov Poslanik sallallahu `alejhi ve selleme, rekao: \"Čistoća (tjelesna i moralna) polovica je imana, zahvala Allahu (el-hamdu lillahi) puni vjerniku mjeru njegovih dobrih djela, veličanje Allaha (subhanellahi) puni sve između nebesa i Zemlje, namaz je nur (svjetlost), sadaka je dokaz (vjere), sabur je sjaj, a Kur`an je dokaz za ili protiv tebe. Svaki čovjek, kada osvane, svoju dušu prodaje, pa je otkupi (od kazne), ili je upropasti.\" - (Muslim)"
    },
    {
        "hadis": "Ebu-Hurejre, r.a., prenosi da je Allahov Poslanik, sallallahu ‘alejhi ve selleme, rekao: \"Ko god ode u džamiju (radi namaza) i vrati se iz nje, Allah mu za svaki njegov odlazak i dolazak pripremi doček u Džennetu.\" - (Muttefekun alejhi)"
    },
    {
        "hadis": "Ebu-Hurejre, r.a., prenosi da je Allahov Poslanik, a.s., upitao: \"Znate li šta je ogovaranje?\" Prisutni rekoše: \"Allah i Njegov Poslanik najbolje znaju!\" \"Ogovaranje je da svog brata muslimana spominješ po onome što on ne voli\", rekao je on. \"A šta ako pri njemu bude ono što spominjemo?\", zapitaše.\"Ako bude pri njemu ono što spominješ, ogovorio si ga, a ako to ne bude pri njemu, potvorio si ga.\" (Muslim)"
    },
    {
        "hadis": "Jeiš b. Tihfa el-Gifarija, r.a., pripovijeda: \"Moj je otac rekao: 'Dok sam ležao u mesdžidu potrbuške, došao je čovjek i svojom nogom me pomakao i rekao: 'Zaista ovako ležanje Allah mrzi.' Pa sam pogledao, kad to bi Allahov Poslanik, s.a.v.s.\" (Ebu-Davud, sahih) "
    },
    {
        "hadis": "Ebu-Hurejre, r.a., prenosi da je Allahov Poslanik, a.s., rekao: \"Čovjek izgovori riječ dragu Allahu, ne obraćajući na nju pažnju, a Allah će ga zbog nje uzdići na visoke stepene; drugi izgovori riječ koja rasrdi Allaha, ne obraćajući pažnju na nju, a zbog nje će biti bačen u Džehennem.\" (Buhari)"
    },
    {
        "hadis": "Ibn-'Abbas, r.a., prenosi da je Allahov Poslanik, a.s., prošao pokraj dva kabura i rekao: \"Ova dvojica se sada kažnjavaju, a ne kažnjavaju se zbog velikog grijeha, ali on je doista velik kod Allaha! Prvi je prenosio tuđe riječi, a drugi se nije čuvao mokraće kada je obavljao malu nuždu.\" (Muttefekun alejhi"
    },
    {
        "hadis": "Ebu Hurejre r.a. prenosi da je Allahov Poslanik, sallallahu `alejhi ve selleme,  rekao: \"Kome Allah dž.š., želi dobro, stavi ga na kušnju (belaj).\" - (Buhari)"
    },
    {
        "hadis": "Zejneba, kći Ebu-Selemea, r.a., kazuje da je posjetila Ummu Habibu, r.a., ženu Allahova Poslanika, a.s. Ona naredi da joj donesu miris od šafrana, njime namirisa djevojčicu, zatim namirisa sebi obraze i reče: \"Tako mi Allaha, nije mi do mirisa, nego sam čula Allahovog Poslanika, a.s., kada je rekao sa mimbera: 'Nije dozvoljeno ženi, koja vjeruje u Allaha i onaj svijet, nositi odjeću žalosti duže od tri dana, osim za mužem, kada je može nositi četiri mjeseca i deset dana.\"\"Zejneba dalje nastavlja: \"Zatim sam posjetila Zejnebu, kći Džahšovu, r.a., kada joj je umro brat. Ona je pozvala da joj donesu miris, namirisala se i rekla: 'Tako mi Allaha, nije mi do mirisa, nego sam čula Allahovog Poslanika, a.s., kada je rekao sa mimbera: 'Nije dozvoljeno ženi, koja vjeruje u Allaha i onaj svijet, da nosi odjeću žalosti duže od tri dana, osim za mužem, kada je može nositi četiri mjeseca i deset dana.'\" (Muttefekun alejhi)"
    },
    {
        "hadis": "Ebu-Se'id El-Hudri, r.a., prenosi: \"Allahov Poslanik, sallallahu 'alejhi ve selleme, zabranio je da se puše u piće, pa je neki čovjek rekao: 'A šta sa trunkom koju ugledam uposudi?' 'Prospi je!', odgovori Poslanik. 'Ja ne mogu piti u jednom dahu (dušku)', opet će čovjek. 'Onda ukloni posudu od usta!', (za vrijeme predaha), reče Poslanik.\" (Tirmizi, Nesai, sahih) "
    },
    {
        "hadis": "Ebu-Hurejre, r.a., prenosi da je Allahov Poslanik, a.s., rekao: \"Ne pripada nama onaj ko se protiv nas oružjem bori, i ne pripada nama onaj ko nas vara.\" (Muslim) U drugom predanju bilježi se i da je Allahov Poslanik, a.s., naišao pored gomile hrane u koju je zavukao ruku, i kada je osjetio vlagu pod prstima, zapita prodavača: \"Šta je ovo, vlasniče hrane?\" \"Pokisnulo je, Allahov Poslaniče!\" \"Zašto vlažnu hranu nisi stavio na vrh da je ljudi vide? Ne pripada nama onaj ko nas vara!\""
    },
    {
        "hadis": "Ebu-Hurejre, r.a., prenosi da je Allahov Poslanik, a.s., rekao: \"Kada se prouči ikamet, onda je dozvoljeno klanjati samo farz za koji je ikamet proučen.\" (Muslim)"
    },
    {
        "hadis": "Džubejr b. Mut'im, r.a., prenosi daje Allahov Poslanik, sallallahu ‘alejhi ve selleme, rekao: \"Neće ući u Džennet onaj koji prekine veze sa svojom rodbinom.\" - (Muttefekun alejhi)"
    },
    {
        "hadis": "Od Ebu-Hurejrea, r.a., prenosi se da je Allahov Poslanik, s.a.v.s., rekao: \"Ko spomene Allaha (tesbih učini, tj. kaže 'subuhanallahi') na kraju svakog namaza trideset tri puta, zahvali se Allahu (kaže: 'elhamdu lillahi') trideset tri puta, izgovori tekbir (kaže: 'Allahu ekber') trideset tri puta, i upotpuni stotinu sa: 'La ilahe illallahu vahdehu la šerikelehu, lehu-l-mulku ve lehu-l-hamdu, ve huve' ala kulli šej'in kadir' (Nema drugog boga, osim Allaha. Njemu pripada sva vlast i svaka hvala, i On je svemoćan), biti će mu oprošteni (mali) grijesi, pa makar ih bilo kao morske pjene.\" (Muslim)"
    },
    {
        "hadis": "Aiša, r.a., kazuje: \"Kurejšije su se zabrinule zbog jedne žene iz roda Mahzum, koja je ukrala, pa su se raspitivali: 'Ko će zbog nje govoriti Allahovom Poslaniku, a.s.?' Neki rekoše: 'Na to se smije odvažiti samo Usame b. Zejd, miljenik Allahovog Poslanika, a.s.' Kada je Usme posredovao, Allahov Poslanik, a.s., zapita ga: 'Zar posreduješ zbog izvršenja kazne Uzvišenog Allaha?' Nakon toga je Allahov Poslanik, a.s., održao govor i rekao: 'Narodi prije vas uništeni su zato što nisu kažnjavali ugledne kada ukradu, a kada ukradu slabi, kažnjavali su ih. Tako mi Allaha, kada bi Fatima, kći Muhammedova, ukrala, Muhammed bi joj odsjekao ruku!'\" (Muttefekun alejhi)"
    },
    {
        "hadis": "Bera' ibn 'Azib, r.a., prenosi da je Allahov Poslanik, sallallahu 'alejhi ve selleme, rekao: \"O, čovječe, kada legneš u svoju postelju reci: 'Allahu moj, predajem Tebi dušu svoju, okrećem Tebi lice svoje, prepuštam Tebi probleme svoje, pa na Tebe se oslanjam, nadajući se Tebi i strahujući od Tebe; nema sigurnog skloništa i pribježišta osim Tebe. Ja vjerujem u Tvoju Knjigu koju Si objavio, i Tvog Poslanika kojeg si poslao.' Ako to proučiš i te noći umreš, umro si u potpunoj čistoći (fitretu), a ako osvaneš, uradio  si hajr - dobro.\" (Muttefekun alejhi)"
    },
    {
        "hadis": "Ebu Hurejre, r.a., prenosi da je Allahov Poslanik, sallallahu `alejhi ve selleme, rekao: \"Allah, dž.š. veli: 'Nema druge nagrade za Mog roba mu`mina kojem Ja usmrtim njegovu voljenu osobu na ovome svijetu (njegovo dijete), pa se on - nadajući se nagradi - strpi na tom gubitku, osim Dženneta.'\" - (Buhari)"
    },
    {
        "hadis": "Ebu-Hurejre, r.a., prenosi da je Allahov Poslanik, sallallahu 'alejhi ve selleme, rekao: \"Svi će moji sljedbenici biti sačuvani od jezika drugih ljudi (ogovaranja), osim onih koji javno i otvoreno griješe, a od javnih grijeha je i kada čovjek nešto noću uradi, a zatim osvane, a da niko osim Allaha ne zna za njegov grijeh, pa onda rekne svome drugu: \"Ja sam sinoć uradio to i to.\" Allah ga je bio sakrio, a on osvanuo i objelodanjuje ono što je Allah već bio sakrio.\" - (Muttefekun alejhi)"
    },
    {
        "hadis": "Aiša, r.a., pripovijeda daje Allahov Poslanik, sallallahu ‘alejhi ve selleme, jedne prilike ušao u njenu kuću i kod nje zatekao jednu ženu, te je upitao: \"Ko je ova žena?\" Ona mu je na to odgovorila da je ovo ta i ta žena pa je pomenula kako ona puno klanja (nafilu) namaz. On tada reče: \"Neka svako od vas obavlja nafilu onoliko koliko je u stanju (da ustraje u njoj). Tako mi Allaha, Allahu neće dosaditi dok vama samima ne dosadi, a Allahu su najdraža djela u kojima čovjek ustraje.\" - (Muttefekun alejhi) Izraz: \"Allahu neće dosaditi\" znači: Allah vas neće prestati nagradivati za vaša djela, i to mu neće dosaditi, sve dok vama ne dosadi, pa prestanete s ibadetom. Zato trebate uzeti samo onoliko vanrednih ibadeta koliko ste u stanju stalno i bez prestanka obavljati, kako bi vam bila trajna nagrada od Allaha."
    },
    {
        "hadis": "Šeddad ibn Evs, r.a., prenosi da je Allahov Poslanik, sallallahu 'alejhi ve selleme, rekao: \"Pametan je onaj koji strogo vodi računa o svojim postupcima, i radi za život poslije smrti, a slabić je onaj koji slijedi svoje strasti i bezrazložno se nada i pouzdava u Allaha.\" (Tirmizi, hasen)"
    },
    {
        "hadis": "Prenosi se da je Ebu-Abdurrahman, Abdullah b. Mes'ud, r.a., rekao: \"Pitao sam Allahovog Poslanika, sallallahu 'alejhi ve selleme, koje je djelo Allahu najdraže? Alejhisselam reče: 'Namaz u njegovo pravo vrijeme.' Zatim sam upitao: 'A koje poslije njega?' 'Dobročinstvo svojim roditeljima', odgovori on. 'Koje poslije njega?', ponovo upitah. 'Džihad na Allahovom putu', odgovori on.\" - (Muttefekun alejhi)"
    },
    {
        "hadis": "Od Džabira, r.a., prenosi se da je rekao: \"Čuo sam Allahova Poslanika, s.a.v.s., kako kaže: 'U noći ima jedan čas (momenat) u kojem, ako čovjek musliman potrefi, moleći Allaha Uzvišenog neko dunjalučko ili ahiretsko dobro, molba mu biva uslišana; taj čas ima usvakoj noći.'\" (Muslim)"
    },
    {
        "hadis": "Aiša, r.a., prenosi da je Allahov Poslanik, sallallahu 'alejhi ve selleme, rekao: \"Rodbinska krvna veza visi o 'Aršu i viče: 'Ko mene održava i poštuje, i njega će Allah, dž.š., posjećivati i poštivati, a ko mene ne održava i ne poštuje, neće ni Allah, dž.š., njega posjećivati niti poštivati.\"' -(Muttefekun alejhi)"
    },
    {
        "hadis": "Ebu-Hurejre, r.a., prenosi da je Allahov Poslanik, sallallahu 'alejhi ve selleme, rekao: \"Kada se ljudi okupe u jednoj od Allahovih kuća (džamija) da uče Allahovu Knjigu (Kur'an) i da je međusobno proučavaju, na njih se spusti mir, prekrije ih Allahova milost, okruže ih meleki i Allah ih spomene među onima koji su kod Njega.\" (Muslim)"
    },
    {
        "hadis": "Ebu-Hurejre, r.a., prenosi da je Allahov Poslanik, sallallahu ‘alejhi ve selleme, rekao: \"Ko je bespravno oštetio svoga brata u njegovoj časti, ili bilo čemu drugom, neka od njega zatraži halala (oprosta) odmah danas, prije nego što dinari i dirhemi neće imati vrijednosti, niti će ih biti, nego, ako imadne dobrih djela, njima će se naplatiti njegovo nasilje i nepravda, a ako ne bude imao dobrih djela, onda će mu se dati od grijeha oštećenog, prema šteti koju mu je načinio.\" -(Buhari)"
    },
    {
        "hadis": "Od Ibn-'Abbasa, r.a., prenosi se da je Vjerovjesnik, s.a.v.s., rekao: \"Umra uz ramazan vrijedi koliko i hadž, ili koliko hadž obavljen sa mnom.\" (Muttefekun alejhi)"
    },
    {
        "hadis": "Ebu-Hurejre, r.a., pripovijeda da je jedan čovjek došao Allahovom Poslaniku, sallallahu 'alejhi ve selleme, i upitao: \"O Božiji Poslaniče, za koju sadaku čovjek ima najveću nagradu?\" Alejhisselam odgovori: \"Da udijeliš sadaku kada si zdrav i škrt, bojeći se siromaštva, a nadajući se bogatstvu. I nemoj odugovlačiti (sa sadakom) dok ti dođe duša u grlo, pa da onda povičeš: 'Podajte tome toliko, a tome toliko, kad je to već postalo njihovo.'\" - (Muttefekun alejhi)"
    },
    {
        "hadis": "Aiša, r.a., pripovijeda: \"Došla mi je jedna žena, koja prosi s dvoje ženske djece, a ja nisam imala ništa joj dati osim jedne hurme. Ja joj dadoh tu hurmu, a ona je uze, raspolovi i dade svojim kćerima, a ona nimalo ne uze. Zatim je ustala i otišla. Poslije toga nam je došao Allahov Poslanik, sallallahu 'alejhi ve selleme, i ja mu ispričah što se desilo, a on reče: 'Ko bude stavljen na kušnju sa ma koliko kćeri, pa bude dobar prema njima i lijepo ih odgoji, one će mu biti štit od vatre na Sudnjem danu.\"' - (Muttefekun alejhi)"
    },
    {
        "hadis": "Od Aiše, r.a., prenosi se da je rekla: \"Vjerovjesnik, s.a.v.s., klanjao je noću toliko da bi mu čak stopala naticala, pa sam mu rekla: 'Zašto to radiš, o Allahov Poslaniče, kad su ti oprošteni grijesi koje si počinio i koje ćeš počiniti?\" On mi je odgovorio: 'A zar da ne budem zahvalan rob?'\" (Muttefekun alejhi)"
    },
    {
        "hadis": "Ebu-Hurejre, r.a., prenosi da je Allahov Poslanik, sallallahu ‘alejhi ve selleme, rekao: \"Najpotpuniji iman je onog vjernika koji se najljepše ponaša, a najbolji među vama su oni koji su najbolji prema svojim ženama.\" - (Tirmizi, hasen, sahih)"
    },
    {
        "hadis": "Ebu-Se'id el-Hudri, r.a., prenosi da je Allahov Poslanik, a.s., rekao: \"Na Sudnjem danu svaki varalica imat će kod stražnjice zastavu, koja će biti velika prema veličini njegove prevare. A najveći varalica je vladar koji vara narod.\" (Muslim)"
    },
    {
        "hadis": "Ebu-Abbas b. Sad Sehe es-Sadij, kaže: \"Prošao je neki čovjek pored Poslanika, s.a.v.s., pa Poslanik, s.a.v.s., reče čovjeku koji je sjedio pored njega: ‘Šta misliš o ovome?' Čovjek reče: ‘Jedan od uglednih ljudi (plemić), mislim, ako on zaprosi djevojku, oženit će se njome, ako se zauzme za nekog, prihvatit će mu se zauzimanje.' Pa je Poslanik, s.a.v.s., ušutio. Iza toga prođe drugi čovjek, pa Poslanik, s.a.v.s., upita: 'Šta misliš o ovome?' On odgovori: 'Allahov Poslaniče, ovo je jedan od siromašnih muslimana, ovaj mislim, ako zaprosi dievojku, ona se neće udati za njega, a ako se zauzme za nekoga neće mu se zauzimanje primiti; ako bude govorio niko neće slušati šta govori.' Na to reče Poslanik, s.a.v.s.: ‘Ovaj je bolji od svih onakvih na zemlji.\"' - (Muttefekun alejhi)"
    },
    {
        "hadis": "Ebu-Hurejre, r.a., prenosi da je Allahov Poslanik, a.s., rekao: \"Ljudi, Allah je dobar i prima samo dobro. Allah je vjernicima naredio ono što je naredio i poslanicima kada je rekao: 'O poslanici, jedite dozvoljena i lijepa jela, i dobra djela činite.' (El- Mu'minum, 51) 'O vjernici, jedite dozvoljena i lijepa jela koja smo vam podarili.' (El-Bekara,172) Zatim je govorio o čovjeku raščupane kose i prašnjavaom od dugoga putovanja, koji diže ruke nebu moleći: 'Gospodaru moj, Gospodaru moj!' A hrana mu je haram, piće mu je haram, odjeća mu je haram i hranjen je haramom! Kako mu dova onda može biti primljena?\" (Muslim)"
    },
    {
        "hadis": "Ibn-\"'Abbas, r.a., prenosi: \"Allahov Poslanik, a.s., prokleo je ženstvene muškarce i muškobanjaste žene.\" (Buhari) Prema drugom predanju: \"Allahov Poslanik, a.s., prokleo je muškarce koji oponašaju žene u nošnji i žene koje u nošnji oponašaju muškarce.\""
    },
    {
        "hadis": "Ebu-Zerr, r.a., prenosi da je Allahov Poslanik, sallallahu ‘alejhi ve selleme, rekao: \"Meni su izložena djela mojih sljedbenika, dobra i loša, pa sam vidio da u njihova dobra djela spada i uklanjanje s puta onoga što smeta prolaznicima, a da u njihova loša djela spada i neuklonjena pljuvačka iz mesdžida.\" (Muslim)"
    },
    {
        "hadis": "Džabir, r.a., prenosi da je Allahov Poslanik, a.s., rekao: \"Ko jede luk ili bijeli luk, neka se udalji od nas, ili neka napusti džamiju.\" U Muslimovom predanju kaže se: \"Ko jede luk, crveni ili bijeli luk ili prasu, neka se ne približava džamiji, jer i meleki osjećaju neprijatnost od onoga od čega je ljudi osjećaju.\" (Muttefekun alejhi)"
    },
    {
        "hadis": "Ebu-Hurejre, r.a., prenosi da je Allahov Poslanik, a.s., rekao: \"Očistite postelju kada liježete, jer ne znate šta je iza vas ostalo u postelji, a zatim proučite: 'Gospodaru moj, u Tvoje ime liježem i ustajem. Ako mi dušu uzmeš, smiluj joj se, a ako me poživiš, sačuvaj me, kao što čuvaš Svoje dobre robove!'\" (Muttefekun alejhi)"
    },
    {
        "hadis": "Ebu-Hurejre, r.a., prenosi da je Allahov Poslanik, a.s., rekao: \"Ko bude držao psa, osim u svrhu čuvanja stoke i usjeva, svaki dan će mu nagrada za dobra djela biti umanjivana koliko brdo Uhud (kirat).\" U Muslimovom predanju još se kaže: \"Ko bude posjedovao psa, osim psa za lov ili čuvanje stoke i usjeva, nagrada će mu svaki dan biti umanjivanja za dva kirata."
    },
    {
        "hadis": "Od Ibn -'Umera r.a., se prenosi da je rekao: \"Allahov Poslanik, s.a.v.s., uzeo me za moje rame i rekao: ‘Budi na dunjaluku kao da si stranac ili prolaznik.' A Ibn -'Umer, r.a., je govorio : ‘Kada zanoćiš, nemoj očekivati jutra, a kada osvaneš, nemoj očekivati noći, iskoristi zdravlje prije bolesti i iskoristi život prije smrti.\"' - (Buhari)"
    },
    {
        "hadis": "Enes, r.a., pripovijeda da je Resulullah, sallallahu 'alejhi ve selleme, zabranio da se pije stojeći. 'Mi smo tada rekli Enesu\", veli Katade: 'A šta je sa jelom?\" 'To je još gore, ružnije\", odgovori on.\" (Muslim)"
    },
    {
        "hadis": "Aiša, r.a., prenosi da je Allahov Poslanik, sallallahu ‘alejhi ve selleme, toliko dugo stajao na noćnom (nafila) namazu, da bi mu noge znale oteći, pa mu je ona rekla: 'Zašto to činiš, Božiji Poslaniče, kad ti je Allah oprostio sve prošle, a i buduće grijehe?' On joj na to odgovori: 'Zar ne treba da se trudim i budem zahvalan rob?'\" - (Muttefekun alejhi)"
    },
    {
        "hadis": "Od Ebu-Hurejrea, r.a., prenosi se da je Allahov Poslanik, s.a.v.s., rekao: \"Ko se u petak okupa, poput kupanja od džunupluka, zatim ode u džamiju u prvom satu - kao da je devu žrtvovao; ko ode u drugom satu - kao da je kravu žrtvovao; ko ode u trećem satu - kao da je rogatog ovna žrtvovao, ko ode u četvrtom satu kao da je kokoš žrtvovao, ko ode u petom satu - kao da je jaje udijelio, a kada se imam pojavi (na minberu) - dođu meleci i slušaju hutbu.\" (Muttefekun alejhi)"
    },
    {
        "hadis": "Abdullah ibn Mes'ud, r.a., kaže da je Allahov Poslanik, a.s., rekao: \"Nije dozvoljeno zavidjeti, osim u dvije stvari: čovjeku kojem je Allah, dž.š., dao imetak, pa ga on troši za Istinu, i čovjeku kojem je Allah, dž.š., dao mudrost, pa on po njoj sudi i druge njoj podučava.\" - (Muttefekun alejhi)"
    },
    {
        "hadis": "Ebu-Se'id i Ebu-Hurejre, r. anhuma, prenose da je Allahov Poslanik, sallallahu 'alejhi ve selleme, rekao: \"Kada trojica krenu na put, neka jednog odrede za emira - vođu puta.\" (Ebu-Davud, hasen)"
    },
    {
        "hadis": "Ebu-Zerr, r.a., rekao je: \"O Allahov Poslaniče, zar me nećeš postaviti odgovornim za nešto?\" Pa me je on udario po ramenu i rekao: ‘O Ebu-Zerr, ti si, zaista, slabašan, a to je emanet (povjerenje), a na Sudnjem danu bit će poniženje, sramota i kajanje, osim za onoga koji se toga prihvati, a sposoban je za to, te izvrši ono što je u tom pogledu obavezan.'\" - (Muslim)"
    },
    {
        "hadis": "Ebu-Mes'ud Ukbe ibn 'Amr, Ensari i Bedri, r.a., prenosi da je Allahov Poslanik, sallallahu ‘alejhi ve selleme, rekao: \"Ko ukaže i povede nekog na dobro djelo, ima nagradu kao i izvršilac.\" - (Muslim)"
    },
    {
        "hadis": "Ebu-Se'id el-Hudri, r.a., prenosi da je Allahov Poslanik, a.s., rekao: \"Uzvišeni Allah reći će džennetlijama: 'O džennetlije!', i oni će se odazvati: 'Odazivamo Ti se, Gospodaru, u Tebe je svako dobro!' Allah će ih upitati: 'Jeste li zadovoljni!' 'A kako da ne budemo zadovoljni, Gospodaru, kada si nam dao ono što nisi dao nikome od Tvojih stvorenja!',odgovorit će. Onda će im Allah reći: 'Hoćete li da vam dam nešto još bolje od toga?' 'A šta može biti još bolje od toga?', zapitat će. 'Obasut ću vas svojim zadovoljstvom i nikada se na vas više neću rasrditi!', reći će im Allah.\" (Muttefekun alejhi)"
    },
    {
        "hadis": "Ebu-Hurejre, r.a., prenosi od Allahovog Poslanika, s.a.v.s., da je rekao: \"Tako mi Allaha, ja zatražim oprost od Allaha, dž.š., i obratim Mu se tevbom više od sedamdeset puta dnevno.\" (Buhari)"
    },
    {
        "hadis": "Ebu-Hurejre, r.a., prenosi da je Allahov Poslanik, a.s., rekao: \"Nije dozvoljeno vjerniku izbjegavati brata vjernika duže od tri dana. Ako prođu tri dana, neka ga potraži i nazove mu selam, pa ako primi selam, imaju podjednaku nagradu, a ako ne primi selam, snosit će grijeh, dok je onaj koji je nazvao selam tim činom prestao izbjegavati brata muslimana.\" (Ebu-Davud, hasen)"
    },
    {
        "hadis": "Džabir, r.a., kazuje: \"Allahov Poslanik, a.s., zabranio je da se vrši mala nužda u stajaćoj vodi.\" (Muslim)"
    },
    {
        "hadis": "Abdullah b. 'Amr b. el-'As, r.a., prenosi da je čuo Allahova Poslanika, sallallahu 'alejhi ve selleme, kad kaže: \"Kada čujete ezan, ponavljajte za mujezinom, a zatim salavat na mene donesite, jer ko jedan salavat na mene donese, Allah će na njega donijeti deset. Potom molite Allaha da mi podari 'El-Vesile', mjesto u Džennetu koje ne priliči nikom osim jednom od Allahovih robova, a ja se nadam da ja budem taj rob, pa ko mi bude tražio 'El-Vesile', imat će pravo na moj šefaat.\" (Muslim)"
    },
    {
        "hadis": "Ibn-Omer, r.a., prenosi da je Allahov Poslanik, a.s., rekao: \"Zabranjeno je dvojici da se sašaptavaju u prisustvu trećeg.\" (Muttefekun alejhi)"
    },
    {
        "hadis": "Umu Seleme, r.a., prenosi da je Allahov Poslanik, s.a.v.s., rekao: \"Koja god žena umre, a njen muž bude njome zadovoljan, ući će u Džennet.\" (Tirmizi, hasen)"
    },
    {
        "hadis": "Ibn-Abbas, r.a., prenosi da je, jedanput, pored Allahovog Poslanika, a.s., prošao magarac žigosane glave, pa je rekao: \"Allah prokleo onoga ko ga je žigosao!\" (Muslim) Drugo Muslimovo predanje bilježi: \"Allahov Poslanik, a.s., zabranio je udaranje i žigosanje po licu!\""
    },
    {
        "hadis": "Prenosi se od Zubejra b. Adijja da je rekao: \"Došli smo kod Enesa b. Malika, r.a., i žalili se njemu na ono što nas je snašlo od Hadžadža, pa reče: 'Strpite se, jer, uistinu, neće doći ni jedno vrijeme a da ono poslije njega nije gore od njega. Sve će bit tako dok ne sretnete svoga Gospodara.' To sam čuo od vašeg Poslanika, s.a.v.s.\" - (Buhari)"
    },
    {
        "hadis": "Adijj b. Hatim, r.a., prenosi da je Allahov Poslanik, a.s., rekao: \"Allah će razgovarati sa svakim od vas bez posrednika. Čovjek će pogledati na desnu stranu i vidjet će samo svoja djela, zatim će pogledati na lijevu stranu i vidjet će svoja djela, pa će pogledati ispred sebe i ugledat će samo vatru! Zato se čuvaite vatre, pa makar polovinom udjeljene hurme.\" - (Muttefekun alejhi)"
    },
    {
        "hadis": "Ibn-'Umer i Aiša, r.a., prenose da je Allahov Poslanik, sallallahu ‘alejhi ve selleme, rekao: \"Toliko mi je često Džibril oporučivao susjeda, da sam mislio da če ga učiniti (zakonitim) nasljednikom.\" - (Muttefekun alejhi)"
    },
    {
        "hadis": "Aiša, r.a., kazuje da je rekla Allahovom Poslaniku, a.s.: \"Dovoljno ti je što je Safija takva i takva!\", tj. niskog rasta, na što on reče: \"Rekla si tako krupnu riječ, koja bi, kada bi se pomiješala s morem, promijenila mu miris!\" Ona, dalje, kaže: \"Jednom sam pred njim oponašala nekog čovjeka, i Allahov Poslanik,a.s., mi reče: 'Ne bih nekoga oponašao, kada bi mi dali toliko i toliko bogatstva!'\" (Ebu-Davud, Tirmizi, hasen, sahih) "
    },
    {
        "hadis": "Umer ibn Ebi-Seleme r.a., prenosi: \"Allahov Poslanik, s.a.v.s., rekao mi je: 'Spomeni Allaha, jedi svojom desnom (rukom), i jedi ispred sebe!'\" (Muttefekun alejhi)"
    },
    {
        "hadis": "Od Ibn-Mes'uda, r.a., prenosi se da je rekao: \"Allahov Poslanik, s.a.v.s., je rekao : 'Džennet je bliži svakom od vas od kaiša na vašoj obući, a i Džehennem isto tako.\"' - (Buhari)"
    },
    {
        "hadis": "Ebu-Hurejre, r.a., prenosi da je Allahov Poslanik, sallallahu ‘alejhi ve selleme, rekao: \"Znate li vi ko je muflis (propali, bankrot)?\" Ashabi odgovoriše: \"Muflis je kod nas onaj koji nema ni novca ni robe.\" Alejhisselam reče: \"Muflis moga ummeta je onaj ko dođe na Sudnji dan s namazom, postom i zekatom, ali je psovao onog, potvorio ovog, u imetku zakinuo onog, prolio krv (ranio) ovog, udario onog... Pa će se svakom od njih dati dio njegovih dobrih djela, a ako mu nestane dobrih djela prije nego što se svima oduži, onda će se uzeti od njihovih loših djela i prebaciti na njega, pa će se onda, zajedno s njima, strovaliti u vatru.\" - (Muslim)"
    },
    {
        "hadis": "Omer, r.a., pripovijeda da je čuo Allahovog Poslanika, sallallahu 'alejhi ve selleme, kada je rekao: \"Kada biste se vi istinski uzdali i oslanjali na Allaha, dž.š., On bi vas opskrbljivao kao što opskrbljuje ptice. Ujutru krenu letjeti praznih stomaka, a vraćaju se punih.\" (Tirmizi, hasen)"
    },
    {
        "hadis": "Ebu-Hurejre, r.a., prenosi da je Allahov Poslanik, sallallahu ‘alejhi ve selleme, rekao: \"Čovjek (rob) neće sakriti mane čovjeka na dunjaluku, a da Allah neće sakriti njegove na Kijametskom danu.\" - (Muslim)"
    },
    {
        "hadis": "Ebu-Džuhejm Abdullah b. Haris b. Simme el-Ensari prenosi da je Allahov Poslanik,a.s., rekao: \"Kada bi znao koliki grijeh čini onaj ko prolazi ispred klanjača, bilo bi mu bolje da sačeka četrdeset (dana, mjeseci ili godina) nego da prođe ispred njega.\" (Muttefekun alejhi)"
    },
    {
        "hadis": "Prenosi se da je 'Abdullah ibn 'Umer, r.a., rekao: \"Čuo sam Allahovog Poslanika, s.a.v.s., kada je ispričao slijedeće: 'Zaputila se trojica ljudi od prijašnjih naroda na dalek put, te ih zateče noć pored jedne pećine, u koju uđoše da bi u njoj prenoćili. Međutim, jedna stijena odroni se i potpuno zatvori ulaz u pećinu. Oni tada jedan drugome rekoše: 'Jedini način da se spasimo iz ove situacije je da zamolimo Allaha, dž.š., da ukloni ovu stijenu zbog naših dobrih djela koje smo učinili.' Jedan od njih tada reče: 'Allahu dragi, ja sam imao stare i iznemogle roditelje i nikad nisam prije njih nahranio niti napojio svoju djecu, niti svoju porodicu i sluge. Jednog dana tražio sam bolju pašu svome stadu, pa im nisam došao na vrijeme, te sam ih, nakon što sam im namuzao mlijeka i donio, našao da spavaju. Nezgodno mi je bilo da ih probudim, ali i da prije njih nahranim i napojim svoju porodicu i svoje robove, pa sam čekao sa sudom u svojoj ruci i gledao kada će se sami probuditi, i tako stajao sve do zore, a djeca su oko mojih nogu plakala od gladi. Zatim su se probudili i popili svoj dio mlijeka. Dragi Allahu, ako sam ja to učinio isključivo radi Tebe, a ni radi čega drugog, onda nam odmakni ovu stijenu sa vrata ove pećine u kojoj smo mi!' Stijena se malo maknu, ali ne toliko da bi mogli izaći pored nje. Drugi od njih reče: 'Allahu dragi, ja sam imao jednu bližnju rodicu, koju voljeh više od cijeloga svijeta, koju voljeh, (kaže se u jednom drugom predanju - tako jako, kako to ljudi samo vole žene), pa sam je poželio imati, ali ona mi to ne dopusti. Jedne godine, zavladala je jaka glad, te mi ona dođe i zatraži pomoć. Ja joj dadoh 120 zlatnika, ali pod uslovom da mi se dopusti. Ona na to pristade, i kad sam joj se približio (u drugom rivajetu: kad sam je zagrlio, onako kako muž zagrli svoju ženu u postelji), ona zaplaka i reče: 'Boj se Allaha, i ne raskidaj prsten moje nevinosti bespravno!' Na to sam se ja odmakao od nje, iako mi je bila najdraža na svijetu, i ostavio joj zlato koje sam joj bio dao. Allahu dragi, ako sam ja to uradio isključivo radi Tebe, spasi nas ove naše nedaće u kojoj se nalazimo!' Stijena se ponovo malo pomjeri, ali ne toliko da bi mogli izaći. Treći od njih reče: 'Allahu dragi, ja sam držao najamnike i svima sam odmah zasluženu nagradu plaćao, osim jednom čovjeku, koji je pobjegao s posla i otišao prije prijema svoje plaće. Ja sam tu njegovu plaću pošteno uložio, tako da se njegov imetak namnožio. Nakon izvjesnog vremena mi je došao i zatražio svoju plaću koja mu je ostala kod mene. Ja sam mu na to odgovorio: 'Sve što ispred sebe vidiš od ovog blaga: deva, stoke, ovaca i robova, tvoje je!' On mi tada reče: 'Robe Božiji, ne izigravaj se sa mnom!' 'Ne izigravam se sa tobom', rekoh mu ja, na što je on uzeo sav taj imetak i otjerao ga, a da meni nije ništa ostavio. Allahu dragi, ako sam ja to isključivo radi Tebe učinio, spasi nas ove naše nevolje u kojoj se nalazimo!' Stijena se tada potpuno pomjeri, te oni iziđoše iz pećine i odoše dalje.\" (Muttefekun alejhi)"
    },
    {
        "hadis": "Od Ebu- Abdullaha ez-Zubejra ibn el-'Awama', r.a., prenosi se da je Allahov Poslanik, s.a.v.s., rekao: \"Da neko od vas uzme užad, zatim ode na brdo i donese breme drva na svojim ledima, pa ih proda, i Allah mu njima sačuva obraz (da ne traži od drugih), bolje mu je nego da traži od svijeta, pa mu on ili dadne ili ne dadne.\"- (Buhari)"
    },
    {
        "hadis": "Od majke pravovjernih, Džuvejrije bint el-Harisi, r.a., prenosi se da je Vjerovjesnik, s.a.v.s., izašao od nje rano, nakon što je klanjao sabah, a ona je ostala na mjestu gdje je klanjala. Zatim se vratio kada je nastupilo vrijeme duha (namaza), a ona je i dalje sjedila na svom mjestu, pa joj je rekao: \"Još uvijek si ondje gdje sam te ostavio?\" Rekla sam: \"Da.\" Tada je Vjerovjesnik, s.a.v.s., rekao: \"Nakon što sam otišao, rekao sam četiri riječi tri puta; kada bi vagali s onim što si rekla (proučila) od jutros, bile bi od toga teže.\" (Rekao sam): 'Subhanallahi ve bi hamdihi adede halkihi, ve ridae nefsihi, ve zinete 'Aršihi, ve midade kelimatihi' (Slavljen je Allah i Njemu pripada hvala, koliko ima Njegovih stvorenja, koliko je On zadovoljan, koliko je težak Njegov arš i koliko ima tinte kojom su(ispisane) Njegove riječi). (Muslim)"
    },
    {
        "hadis": "Nu'man ibn Bešir, r.a., veli da je Allahov Poslanik, sallallahu ‘alejhi ve selleme, rekao: \"Primjer vjernika u međusobnoj pažnji, milosrđu i saosjećanju primjer je jednog tijela. Kada oboli jedan njegov organ, svi ostali organi odazovu mu se i pridruže u bolu sa nesanicom i temperaturom.\" - (Muttefekun alejhi)"
    },
    {
        "hadis": "Sehl ibn Se'ad, r.a., prenosi da je Allahov Poslanik, sallallahu ‘alejhi ve selleme, rekao: \"Ja i staratelj (zaštitnik) jetima smo u Džennetu ovako (blizu).\" Pa pokaza kažiprstom i srednjakom. - (Buhari)"
    },
    {
        "hadis": "Od Ebu-Hurejrea, r.a., prenosi se da je Allahov Poslanik, s.a.v.s., rekao: \"Ko poziva (Allahovoj) uputi, imat će nagradu jednaku nagradi onih koji ga slijede, ali to ništa neće umanjiti od njihovih nagrada.\" (Muslim)"
    },
    {
        "hadis": "Od Ibn-Mesuda, r.a., prenosi se da je rekao: \"Kome pričinjava zadovoljstvo da sutra sretne Allaha, dž.š., kao musliman, neka čuva ove namaze, jer će biti prepoznat po njima. Zaista je Allah propisao vašem Poslaniku, s.a.v.s., sunnete, Allahove upute, a namazi se ubrajaju u sunnete, upute. Ako vi usklanjate u vašim kućama, kao onaj što izostavlja džemat i klanja u svojoj kući, tada ćete ostaviti sunnet svog Poslanika, s.a.v.s., a ako ostavite sunnet svog Poslanika, s.a.v.s., zalutat ćete. Ja znam da mi (ashabi), nismo izostavljali namaz u džematu, izostavljali su ga samo munafici, poznati licemjeri. Nekada bi nekog od nas dopratili među dvojicom, oslanjajući se na njih dok bi stao u saf.\" (Muslim)"
    },
    {
        "hadis": "Ummu Kulsum bint' Ukbe ibn Ebi-Mu'ajt, r.a., veli: \"Čula sam Allahovog Poslanika, sallallahu ‘alejhi ve selleme, kada je rekao: 'Nije lažac onaj koji nastoji izmiriti ljude, pa prenese dobro ili kaže dobro (lijepu riječ) od sebe, u cilju njihova izmirenja.\"' - (Muttefekun alejhi)"
    },
    {
        "hadis": "Usame ibn Zejd ibn Harise, r.a., veli: \"Čuo sam Allahovog Poslanika, sallallahu 'alejhi ve selleme, kada je rekao: ‘Na Sudnjem danu će dovesti čovjeka i baciti u vatru, pa će mu crijeva iz stomaka ispasti, te će on oko njih kružiti, kao što magarac kruži u mlinskoj okretaljci. Stanovnici Džehennema će se oko njega iskupiti i reći mu: `Šta to bi s tobom, čovječe? Zar nisi naređivao dobro i odvraćao od zla?' On će im tada odgovoriti: 'Jesam, naređivao sam dobro, a sam ga nisam činio, odvraćao sam od zla, a sam sam ga činio.\"' (Muttefekun alejhi)"
    },
    {
        "hadis": "Od Ebu-Hurejrea, r.a., prenosi se da je Allahov Poslanik, s.a.v.s., rekao: \"Uzvišeni Allah rekao je: 'Svako čovjekovo djelo pripada njemu, osim posta; on pripada Meni i Ja za njega (posebno) nagrađujem. Post je štit (od vatre ili grijeha), pa kada neko od vas posti, neka ne govori ružne riječi, i neka ne viče, a ako ga neko opsuje ili napadne, neka kaže: -Ja postim! -Tako mi Onoga, u čijoj je ruci Muhammedova duša, zadah iz usta postača je bolji kod Allaha od mirisa miska. Postač ima dvije radosti: kada iftari, raduje se svome iftaru, a kada susretne svoga Gospodara, obradovat će se svome postu. \"Ovo je Buharijin rivajet, a u drugom njegovom rivajetu stoji: \"... on ostavlja hranu, piće i strasti radi Mene; post je Moj i Ja za njega nagrađujem, za jedno dobro nagrađujem desetorostruko!\" (Muttefekun alejhi)"
    },
    {
        "hadis": "Enes, r.a., prenosi da je Allahov Poslanik, sallallahu ‘alejhi ve selleme, rekao: \"Mejjita (mrtvaca) prati troje: njegova porodica, njegov imetak i njegova djela. Dvoje se vraća, a jedno ostaje s njim. Vraćaju se njegova porodica i njegov imetak. a sa njim ostaju njegova djela.\" - (Muttefekun alejhi)"
    },
    {
        "hadis": "Sulejman ibn Sured, r.a., pripovijeda: \"Sjedio sam s Allahovim Poslanikom, sallallahu ‘alejhi ve selleme, a dvojica ljudi su se međusobno svađali. Jedan od njih je bio sav pocrvenjeo, a vratne žile mu se napele od srdžbe. Allahov Poslanik, 'alejhi-s-selam, reče: ‘Zaista ja znam jednu riječ; kada bi je on izgovorio, otišlo bi od njega ono što ga je snašlo. Kada bi rekao: 'Utječem se Allahu od prokletog šejtana, popustilo bi ga ono što ga je snašlo.' Prisutni tom čovjeku tada rekoše: ‘Allahov Poslanik, sallallahu ‘alejhi ve selleme, ti je rekao da zatražiš utočište kod Allaha, dž.š., od prokletog šejtana.\"' - (Muttefekun alejhi)"
    },
    {
        "hadis": "Ebu-Hurejre, r.a., prenosi da je čuo Allahovog Poslanika, a.s., kada kaže: \"Na Sudnjem danu prvo će biti presuđeno čovjeku koji je poginuo kao šehid na Allahovom putu. Allah će mu pokazati sve blagodati, čovjek će ih potvrditi, pa će ga Allah zapitati:'Šta si učinio sa blagodatima?\" 'Borio sam se na Tvome putu, dok nisam poginuo\", odgovorit će. 'Lažeš! Borio si se da kažu: 'Kako je hrabar!' I eto rekli su', reći će Allah. Zatim će narediti da ga naglavačke bace u vatru Džehennema. I čovjeka-učenjaka, koji je podučavao druge, i mnogo učio Kur'an, Allah će podsjetiti na sve blagodati; on će ih potvrditi i Allah će ga zapitati: 'Što si učinio sa blagodatima?' 'U Tvoje ime sam učio, podučavao druge i učio Kur'an!', reći će on. 'Lažeš! Učio si nauku da ti drugi kažu: 'Što je učen!' I učio si Kur'an, da bi govorili: 'Mnogo uči!' I eto, hvalili su te!', reći će Allah. Zatim će zapovijediti da ga naglavačke bace u Džehennem.\" \"I čovjeka, kojem je Allah dao obilan i svakovrstan imetak, Allah će podsjetiti na sve date blagodati; on će ih potvrditi i Allah će ga zapitati: 'Što si učinio sa blagodatima?' 'Dijelio sam imetak na svaki način za koji sam znao da si Ti zadovoljan!' odgovorit će, a Allah će reći: Lažeš! Dijelio si imetak da bi drugi kazali: Kako je darežljiv! I eto, rekli su! Potom će Allah narediti da ga naglavačke bace u Džehennem.\" (Muslim)"
    },
    {
        "hadis": ".Od Fadale bin 'Ubejda prenosi se da je rekao: \"Allahov Poslanik, s.a.v.s., čuo je nekog čovjeka kako uči dovu u namazu, u kom se nije zahvalio Uzvišenom Allahu niti je donio salavat na Vjerovjesnika, s.a.v.s., pa je Allahov Poslanik, s.a.v.s., rekao: 'Ovaj je požurio!' Zatim ga je pozvao i rekao: 'Kada neko od vas klanja, neka počne sa zahvalom i pohvalom Uzvišenog Gospodara, zatim neka donese salavat na Vjerovjesnika, s.a.v.s., a onda neka moli što hoće.'\" (Ebu-Davud, Tirmizi, sahih)"
    },
    {
        "hadis": "Enes, r.a., pripovijeda da je čuo Allahovog Poslanika, sallallahu 'alejhi ve selleme, kako prenosi od Allaha, dž.š., slijedeće: \"Kada se Moj rob Meni približi za jedan pedalj, Ja se njemu približim za jedan aršin (podlakticu), a ako se on Meni približi za jedan aršin, Ja se njemu približim za jedan ručni hvat (raširenih ruku), a kad on Meni ide hodom, Ja njemu idem trčeći.\" - (Buhari)"
    },
    {
        "hadis": "Ebu-Hurejre, r.a., prenosi da je Allahov Poslanik, sallallahu 'alejhi ve selleme, rekao: \"Gornja ruka (ona koja dijeli) bolja je od donje ruke (one koja uzima). U dijeljenju počni od svojih bližnjih. Najbolja je sadaka ona koja je učinjena iz imućnog stanja (viška imetka). Ko se bude držao čednosti i neposezanja za haramom (držeći se dostojanstveno bez prošnje), Allah će ga pomoći i učiniti čednim, a ko se bori za neovisnost, Allah će ga učiniti neovisnim.\" - (Buhari)"
    },
    {
        "hadis": "Ibn-Mes'ud, r.a., prenosi da je Allahov Poslanik, a.s., rekao: \"Vjernik ne vrijeđa, ne proklinje, nije bestidan i besraman.\" (Tirmizi, hasen)"
    },
    {
        "hadis": "Abdullah bin Mes'ud, r.a., prenosi da je Allahov Poslanik, s.a.v.s., rekao: \"Poslije mene će doći vrijeme kad će vaši pretpostavljeni uzimati bogatstvo za sebe i davati ga kome oni hoće, i mnoge druge stvari (raditi) koje nećete podnositi.\" Rekli su mu: \"O Allahov Poslaniče, šta nareduješ onome koji dočeka to vrijeme?\" Rekao je: \"Izvršavajte svoje obaveze koje ste dužni i molite Allaha za ono što vam pripada.\" - (Muttefekun alejhi)"
    },
    {
        "hadis": "Ebu-Zerr, r.a., prenosi da je Allahov Poslanik, a.s., rekao: \"Uzvišeni Allah kaže: 'Ko učini dobro djelo, dat ću mu deseterostruku nagradu, ili još više. A ko učini grijeh, pa za grijeh je kazna prema zasluzi, ili ga oprostim. Ko Mi se približi pedalj, Ja mu se približim lakat; ko Mi se približi lakat, Ja se njemu približim za hvat; ko Mi dođe idući, Ja mu dođem trčeći; a ko Me susretne s grijesima velikim kao Zemlja, a ne bude Mi ništa pripisivao kao druga, obasut ću ga sa isto toliko oprosta.\"' - (Muslim)"
    },
    {
        "hadis": "Ibn-'Abbas, r.a., pripovijeda da je Allahov Poslanik, sallallahu ‘alejhi ve selleme, ugledao zlatan prsten na ruci jednog čovjeka, te ga skinuo s njegove ruke i bacio, a zatim rekao: \"Pojedini od vas upućuju se prema žeravici vatrenoj, pa je sebi stavljaju na ruke!\" Kada je Allahov Poslanik, sallallahu `alejhi ve selleme, otišao, neko tom čovjeku reče: \"Uzmi svoj prsten, i okoristi se njime!\" Čovjek reče: \"Ne, tako mi Allaha, ja ga nikada necu uzeti, njega je bacio Allahov Poslanik, sallallahu ‘alejhi ve selleme.\" - (Muslim)"
    },
    {
        "hadis": "Ibn-Omer, r.a., prenosi da je Allahov Poslanik, a.s., rekao: \"Žene, udjeljujte sadaku i učite što više istigfar, jer sam vidio da je vas najviše u vatri!\"'A zašto je nas najviše u vatri?', zapita jedna žena. 'Zato što mnogo proklinjete i što ste nezahvalne muževima. Ne znam da iko, kao vi, nepotpunije pameti i vjere, može nadvladati razumnog čovjeka!\"'A šta je manjkavost uma i vjere?', ponovo zapita žena. 'To što je svjedočenje dviju žena ravno svjedočenju jednog muškarca, i što nekoliko dana ne možete klanjati.'\" (Muslim)"
    },
    {
        "hadis": "Enes, b. Malik, r.a., prenosi da je Allahov Poslanik, a.s., rekao: \"Stanovnici Dženneta imaju trg, na kojem se sastaju svakog petka. Sjeverni vjetar će im puhnuti u lica i odjeću, pa će postati još ljepši i otmjeniji. Kada se vrate obiteljima, reći će im: 'Tako nam Allaha, još ste ljepši i otmjeniji!' 'I vi ste, Allaha nam, još ljepši i otmjeniji!', odgovorit će im oni.\" (Muslim)"
    },
    {
        "hadis": "Ebu-Berze, r.a., kazuje: \"Allahov Poslanik, a.s., prezirao je spavanje prije jacije i sijeljenje poslije jacija-namaza.\" (Muttefekun alejhi)"
    },
    {
        "hadis": "Huzejfe, r.a., prenosi da im je Resulullah, sallallahu 'alejhi ve selleme, zabranio upotrebu svile i brokata (vrsta svilene odjeće), da piju iz zlatne i srebrne posude i rekao: \"To je za njih (nevjernike) na dunjaluku, a za vas na ahiretu.\" (Muttefekun alejhi)"
    },
    {
        "hadis": "Od Ebu-Hurejrea, r.a., prenosi se da je rekao: \"Allahov Poslanik, s.a.v.s., rekao je: 'Neka bude ponižen čovjek, u čijem prisustvu budem spomenut, pa na mene ne donese salavat.'\" (Tirmizi, hasen)"
    },
    {
        "hadis": "Od Ebu-Hurejrea, r.a., prenosi se da je rekao: \"Allahov Poslanik, s.a.v.s., rekao je: 'Najbolji dan, u kome se sunce rodilo, jeste petak; toga dana je stvoren Adem, toga dana je uveden u Džennet i toga dana je izašao iz njega.'\" (Muslim)"
    },
    {
        "hadis": "Od Ebu-Katade, r.a., prenosi se da je rekao: \"Allahov Poslanik, s.a.v.s., rekao je: 'Kada neko od vas uđe u džamiju, neka ne sjeda, dok ne klanja dva rekata.'\" (Muttefekun alejhi)"
    },
    {
        "hadis": "Od Ebu-Ejjuba, r.a., prenosi se da je Allahov Poslanik, s.a.v.s., rekao: \"Ko isposti ramazan, zatim posti šest dana ševala, kao da je čitavu godinu postio.\" (Muslim)"
    },
    {
        "hadis": "Ebu-Hurejre, r.a., prenosi od Resulullaha, sallallahu 'alejhi ve selleme, da je rekao: \"Kada se rob musliman (mu'min) abdesti, pa opere svoje lice, spadnu s njega, sa posljednjom kapi vode, svi grijesi koje je počinio očima gledajući; kada opere svoje ruke, spadnu s njih, s posljednjom kapi vode, svi grijesi koje je rukama počinio; a kada opere svoje noge, spadnu s njih, vodom ili s posljednjom kapi vode, svi grijesi radi kojih je nogama hodio, tako da, nakon abdesta, izađe čist od grijeha.\" (Muslim)"
    },
    {
        "hadis": "Ebu-Hurejre, r.a., prenosi da je Allahov Poslanik, sallallahu 'alejhi ve selleme, rekao: \"Allah, dž.š., kaže: 'Ko se neprijateljski ponaša prema Mome evliji (pravom robu), Ja ću mu najaviti rat. Najdraže čime Mi se Moj rob približava jeste ono čime sam ga zadužio (farzovi), a zatim Mi se on približava nafilama sve dok ga ne zavolim, a kad ga zavolim, onda Ja budem njegov sluh, kojim on sluša, njegov vid, kojim on gleda, njegove ruke, kojima on radi, njegove noge; kojima on putuje (u svemu tome pazi da se ne ogriješi o Allahov Zakon). Ako šta zatraži, to mu dadnem, a ako zatraži Moju zaštitu, Ja ga odmah zaštitim.\" (Buhari)"
    },
    {
        "hadis": "Ebu-Hurejre, r.a., prenosi da je Allahov Poslanik, a.s., rekao: \"Ženi nije dozvoljeno da u prisustvu muža posti nafilu bez njegovog odobrenja i nije joj dozvoljeno da bilo kog pušta u kuću bez njegovog odobrenja.\" (Muttefekun alejhi)"
    },
    {
        "hadis": "Od Ebu-Zerra, r.a., prenosi se da je Allahov Poslanik, s.a.v.s., rekao: \"Ako postiš u mjesecu tri dana, onda posti trinaesti, četrnaesti i petnaesti.\" (Tirmizi, hasen)"
    },
    {
        "hadis": "Adijj bin Hatim, r.a., prenosi: \"Allahov Poslanik, s.a.v.s., rekao je: 'Čuvajte se vatre, pa makar sa pola hurme, a ko i to nema, a ono lijepom riječi.'\" (Muttefekun alejhi)"
    },
    {
        "hadis": "Enes, r.a., prenosi da je Allahov Poslanik, sallallahu ‘alejhi ve selleme, rekao: \"Nijedan od vas neće biti pravi vjernik, sve dok ne bude želio svome bratu (prijatelju, muslimanu) ono što želi sam sebi.\" (Muttefekun alejhi)"
    },
    {
        "hadis": "Ukbe ibn 'Amr el-Ensari, r.a., pripovijeda: \"Kada je objavljen ajet kojim se naređuje dijeljenje sadake, mnogi od nas je zarađivao noseći na svojim leđima, da bi udijelio sadaku. Jedan čovjek dođe i podijeli dosta imetka kao sadaku, na što neki (munafici) rekoše: 'Hoće samo da se pokaže!' Zatim je došao drugi čovjek i dao za sadaku samo nekoliko pregršti (pšenice), našto opet neki rekoše: 'Zaista je Allah neovisan od ovakve sadake!' To je bio povod objave ajeta: 'Oni koji vjernike ogovaraju, zato što sadaku daju, a rugaju se i onima koji je s mukom daju Allah će kazniti za izrugivanje njihovo, i njih čeka patnja nesnosna.\" (Tevba, 79) - (Muttefekun alejhi)"
    },
    {
        "hadis": "Ibn-Mes'ud, r.a., jedne prilike, reče: \"Allah je prokleo žene koje se tetoviraju i koje tetoviraju, i žene koje čupaju obrve i stanjuju zube, uljepšavajući se, i tako mijenjaju izgled koji Allah daje stvorenjima!\" Kada mu je jedna žena prigovorila zbog toga, on joj odgovori: \"A zašto da ne proklinjem onoga koga je prokleo Allahov Poslanik, a.s., i čije je prokletstvo u Allahovoj Knjizi? Uzvišeni Allah kaže: 'Ono što vam Poslanik da - to prihvatite, a ono što vam zabrani - ostavite!'\" (El-Hašr, 7) (Muttefekun alejhi)"
    },
    {
        "hadis": "Ebu-Hurejre, r.a., prenosi da je Allahov Poslanik, a.s., rekao: \"Kada se žena ne odazove muževom pozivu u postelju i on zanoći srdit na nju, meleki je proklinju sve do sabaha.\" (Muttefekun alejhi)"
    },
    {
        "hadis": "Prenosi se od vladara pravovjernih, Ebu-Hafsa Omera sina Hattabovog, r.a., da je rekao: \"Čuo sam Allahova Poslanika, s.a.v.s., da je rekao: 'Zaista se djela cijene prema namjerama i zaista će svaki čovjek dobiti ono što je naumio svojim djelom, pa ko bude hidžru učinio u ime Allaha i Njegova poslanika, njegova hidžra je hidžra Allahu i Poslaniku, a ko bude hidžru učinio zbog materijalne dobiti (dunjaluka) ili zbog žene da bi se njome oženio, njegova hidžra je za ono za šta ju je naumio.'\" (Muttefekun alejhi)"
    },
    {
        "hadis": "Ebu-Bekr Nufej' b. Haris, r.a., veli da je Allahov Poslanik, sallallahu ‘alejhi ve selleme, rekao: \"'Hoćete li da vas obavijestim o najvećim grijesima?' - tri puta. Mi odgovorismo: ‘Svakako, o Allahov Poslaniče!' On tada reče: ‘Allahu pripisivanje druga i neposlušnost roditeljima.' Bio je naslonjen, zatim se ispravi sjedeći i reče: ‘Svakako, i lažan govor i lažno svjedočenje!' Zatim je toliko dugo ponavljao ovo dvoje zadnje da smo rekli: ‘Da hoće ušutjeti!\"' - (Muttefekun alejhi)"
    },
    {
        "hadis": "Ebu-Hurejre, r.a., prenosi da je Allahov Poslanik, a.s., rekao: \"Ne odbijajte ponuđeni miris, jer se lahko nosi a ugodno miriše.\" (Muslim)"
    },
    {
        "hadis": "Ebu-Hurejre, r.a., prenosi da je Allahov Poslanik, sallallahu ‘alejhi ve selleme, rekao: \"Džehennem je opkoljen (ograđen) (ovosvjetskim) užicima, a Džennet je opkoljen (ograđen) neprijatnostima.\" - (Muttefekun alejhi)"
    }
]